<?php

return [
    'common' => [
        'operate' => 'ปฏิบัติการ',
        'select_default' => '--กรุณาเลือก--',
        'page_notice' => '<strong>ให้ความสนใจ：</strong> คลิกที่ปุ่มรีเฟรชทางด้านขวาเพื่อรีเฟรช',
        'title' => 'ระบบการจัดการพื้นหลัง',
        "lang" => "ภาษา",

        'created_at' => 'สร้างเวลา',
        'updated_at' => 'ปรับปรุงเวลา',
        'total' => 'ทั้งหมด',
        'count' => 'แถบ',
        'sum' => 'ผลรวมทั้งหมด',
        'upload_image' => 'อัปโหลดภาพ',
        'quick_operate' => 'การดำเนินการทางลัด',

        'member_id' => 'บัญชีสมาชิก',
        'member_name' => 'บัญชีสมาชิก',
        'user_id' => 'บัญชีผู้ดูแลระบบ',
        'api_id' => 'บัญชีผู้ใช้อินเตอร์เฟส',
        'agent_id' => 'หมายเลขบัญชีตัวแทน',
        'top_id' => 'ตัวแทนที่เหนือกว่า',
        'game_type' => 'ประเภทเกม',
        'deleted' => 'ลบแล้ว',

        'login_notice' => 'การแจ้งเตือนการเข้าสู่ระบบ',
        'inner' => 'ภายใน',

        'recharge_list' => 'รายการเติมเงิน',
        'drawing_list' => 'รายการถอนเงิน',
        'user_info' => 'ข้อมูลส่วนบุคคล',
        'modify_pwd' => 'แก้ไขรหัสผ่าน',
        'lang_title' => 'ภาษาของระบบ/Language',
        'fix_url' => 'แก้ไขที่อยู่รูปภาพ',
        'fix_url_notice' => 'คุณแน่ใจหรือไม่ว่าจะทำการซ่อมแซมรูปภาพ？กรุณากรอกที่อยู่ก่อนการซ่อมแซม【ปรับแต่งระบบ - ชื่อโดเมนหลักของเว็บไซต์】，โปรดกรอกที่อยู่ที่ได้รับการแก้ไขในรูทของเว็บไซต์.envแฟ้ม“APP_URL”ช่องข้อมูล；กระบวนการทั้งหมดใช้เวลานาน，โปรดอดใจรอ',
        'logout' => 'ออกจากการล็อกอิน',
        'logout_title' => 'คุณแน่ใจหรือว่าต้องการออกจากระบบ',
        'user_google' => 'ผูกรหัสยืนยันของ Google',
        'color_header' => 'หัว',
        'color_sidebar' => 'แถบด้านข้าง',
        'no_limit' => "ไม่จำกัด",
        'lang_notice' => 'เนื่องจากสายระบบเกี่ยวข้องกับหลายภาษา / สกุลเงินคุณต้องเลือก ภาษา / สกุลเงิน ก่อนจึงจะสามารถสืบค้นข้อมูลได้'
    ],

    'base' => [
        'add_success' => 'การเพิ่มข้อมูลสำเร็จ',
        'add_fail' => 'ล้มเหลวในการเพิ่มข้อมูลใหม่',
        'update_success' => 'อัปเดตข้อมูลสำเร็จ',
        'update_fail' => 'การอัปเดตข้อมูลล้มเหลว',
        'delete_success' => 'ลบเรียบร้อยแล้ว',
        'delete_fail' => 'การลบล้มเหลว',
        'save_success' => 'บันทึกเรียบร้อยแล้ว',
        'save_fail' => 'การบันทึกล้มเหลว',
        'operate_success' => 'ปฏิบัติการสำเร็จ',
        'operate_fail' => 'การดำเนินการล้มเหลวโปรดลองอีกครั้ง',
        'operate_msg' => 'การดำเนินการล้มเหลว:',
        'batch_add_success' => 'การเพิ่มแบทช์สำเร็จ',
        'batch_add_fail' => 'การเพิ่มแบทช์ล้มเหลว',

        'account_forbidden' => 'บัญชีถูกปิดการใช้งาน',
        'login_success' => 'ล็อกอินสำเร็จ',
        'illegal_operation' => 'การดำเนินการที่ผิดกฎหมาย',
        'item_select_required' => 'โปรดเลือกคอลัมน์ที่คุณต้องการดำเนินการ',
    ],

    'upload' => [
        'file_type_error' => 'ไม่สามารถระบุประเภทแฟ้มได้',
        'file_size_error' => 'การอัปโหลดไฟล์มีขนาดใหญ่เกินไปที่จะอัปโหลด',
        'image_file_required' => 'โปรดเลือกภาพที่คุณต้องการอัปโหลด',
        'image_ext_required' => 'โปรดอัปโหลดไฟล์ในรูปแบบภาพ',
        'file_required' => 'โปรดเลือกไฟล์ที่คุณต้องการอัปโหลด',
        'file_ext_error' => 'โปรดอัปโหลดไฟล์ในรูปแบบที่ระบุ',
        'image_size_get_error' => 'เกิดข้อผิดพลาดในการรับขนาดแฟ้ม',
        'file_delete_error' => 'การลบแฟ้มล้มเหลว',
        'file_upload_success' => 'การอัพโหลดแฟ้มสำเร็จ'
    ],

    'notice' => [
        'recharge_title' => 'รายการเติมเงิน',
        'recharge_notice' => '<p>คุณมี <span id="rechargeNum" data-name="rechargel_audio" data-sec="0" >0</span> คำขอโอนเงินยังไม่ได้ดำเนินการ</p>',
        'drawing_title' => 'รายการถอนเงิน',
        'drawing_notice' => '<p>คุณมี <span id="drawingNum" data-name="drawing_audio" data-sec="2">0</span> คำขอถอนเงินยังไม่ได้ดำเนินการ</p>',
        'message_title' => 'รายการจดหมายภายในสถานี',
        'message_notice' => '<p>คุณมี <span id="messageNum" data-name="message_audio" data-sec="4">0</span> จดหมายภายในสถานียังไม่ได้ดำเนินการ</p>',
        'memberagentapplies_title' => 'รายการแอปพลิเคชันตัวแทนสมาชิก',
        'memberagentapplies_notice' => '<p>คุณมี <span id="agentAppliesNum" data-sec="6" data-name="agent_apply_audio">0</span> แอปพลิเคชันตัวแทนยังไม่ได้ดำเนินการ</p>',
        'members_title' => 'รายชื่อสมาชิก',
        'members_notice' => '<p>คุณมี <span id="memberNum" data-name="member_audio">0</span> การแจ้งเตือนการเข้าสู่ระบบสมาชิกที่เฉพาะเจาะจง</p>',
        'activityapplies_title' => 'แอปพลิเคชันกิจกรรมสมาชิก',
        'activityapplies_notice' => '<p>คุณมี <span id="activityNum" data-name="activity_audio">0</span> แอปพลิเคชันกิจกรรมสมาชิก</p>',
        'memberyuebaoplans_title' => 'รายการบันทึกการซื้อสมบัติยอดคงเหลือของสมาชิก',
        'memberyuebaoplans_notice' => '<p>คุณมี <span id="yuebaoNum" data-name="yuebao_audio">0</span> การแจ้งเตือนการซื้อยอดคงเหลือ</p>',
        'creditpayrecord_title' => 'รายการบันทึกการยืม',
        'creditpayrecord_notice' => '<p>คุณมี <span id="creditAppliesNum" data-name="credit_apply_audio">0</span> ใช้สำหรับการแจ้งเตือนโดย</p>',
        'creditpayrecord_overdue_title' => 'รายการบันทึกการยืม',
        'creditpayrecord_overdue_notice' => '<p>คุณมี <span id="creditOverdueNum" data-name="credit_overdue_audio">0</span> การแจ้งเตือนล่าช้ายืม</p>'
    ],

    'btn' => [
        'add' => 'เพิ่ม',
        'batch_delete' => 'ลบเป็นกลุ่ม',
        'batch_add' => 'เพิ่มแบทช์',
        'search' => 'ค้นหา',
        'reset' => 'ตั้งค่าใหม่',
        'edit' => 'แก้ไข',
        'detail' => 'รายละเอียด',
        'delete' => 'ลบ',
        'refresh' => 'รีเฟรช',
        'collapse' => 'พับเก็บ',
        'back' => 'ส่งคืน',
        'save' => 'บันทึกเนื้อหา',
        'export' => 'ส่งออก',

        'title' => 'หัวเรื่อง',
        'content' => 'เนื้อหา'
    ],

    'index' => [
        'title' => 'หน้าแรก',
        'today_register' => 'จำนวนคนที่ลงทะเบียนในวันนี้',
        'today_free' => 'ต้นทุนการตลาดวันนี้',
        'today_bet' => 'วันนี้ผู้เล่นจํานวนเงินเดิมพัน',
        'today_game_profit' => 'รายได้รวมของเกมวันนี้',
        'month_register' => 'จำนวนคนที่ลงทะเบียนในเดือนนี้',
        'month_free' => 'ต้นทุนการตลาดของเดือนนี้',
        'month_bet' => 'จำนวนเงินเดิมพันของผู้เล่นในเดือนนี้',
        'month_game_profit' => 'รายได้รวมของเกมในเดือนนี้',
        '10_days_recharge' => 'บันทึกการเติมเงิน 10 วันล่าสุด',
        '10_days_drawing' => 'บันทึกการถอนเงินใน 10 วันที่ผ่านมา',
        'welcome' => 'ยินดีต้อนรับคุณ，',
        'recharge_title' => 'จำนวนเงินเติมเงิน',
        'drawing_title' => 'จำนวนเงินที่ถอน',

		'site_domain_required' => 'โปรดตรวจสอบให้แน่ใจ【ปรับแต่งระบบ - ชื่อโดเมนหลักของเว็บไซต์】กรอก URL ก่อนการเปลี่ยน',
        'app_url_required' => 'โปรดตรวจสอบให้แน่ใจในไดเรกทอรีรากของเ".env"แฟ้มAPP_URLเติมฟิลด์ด้วย URL ที่ถูกแทนที่',
        'url_same_error' => 'URL ก่อนและหลังการเปลี่ยนมีความสอดคล้องกันโปรดตรวจสอบ',
    ],

    'member' => [
        'field' => [
            "name" => "ชื่อผู้ใช้",
            "password" => "รหัสผ่าน",
            "original_password" => "APIรหัสผ่าน",
            "o_password" => "รหัสผ่านดั้งเดิม",
            "nickname" => "ชื่อเล่น",
            "realname" => "ชื่อจริง",
            "email" => "อีเมล",
            "phone" => "เบอร์มือถือ",
            "qq" => "QQหมายเลข",
            "gender" => "เพศ",
            "invite_code" => "รหัสเชิญ",
            "qk_pwd" => "ถอนรหัสผ่าน",
            "money" => "ยอดเงินในบัญชีกลาง",
            "fs_money" => "ส่งคืนยอดเงินในบัญชี",
            "total_money" => "จำนวนเงินเดิมพันแพลตฟอร์มทั้งหมด",
            "ml_money" => "ยอดคงเหลือของรหัส",
            "score" => "คะแนน",
            "total_credit" => "จำนวนเงินทั้งหมดที่ยืมมา",
            "used_credit" => "ยืมโควต้าที่ใช้ไปแล้ว",
            "register_ip" => "ลงทะเบียนIP",
            "register_area" => "พื้นที่ลงทะเบียน",
            "register_site" => "ช่องทางการลงทะเบียน",
            "status" => "สถานะ",
            "is_tips_on" => "จะเปิดการแจ้งเตือนการเข้าสู่ระบบหรือไม่",
            "is_in_on" => "ไม่ว่าจะเป็นบัญชีภายใน",
            "top_id" => "ตัวแทนที่เหนือกว่าid",
            "agent_id" => "ตัวแทนid",
            "level" => "VIPระดับ",
            "is_demo" => "ไม่ว่าจะเป็นบัญชีตัวอย่าง",

            "is_online" => "ไม่ว่าจะออนไลน์",
            "lang" => "ภาษา/ สกุลเงิน"
        ],

        'index' => [
            'title' => 'รายชื่อสมาชิก',
            'register_setting' => 'ตั้งค่าตัวเลือกการลงทะเบียน',
            'is_agent_and_top_agent' => 'ไม่ว่าจะเป็นพร็อกซี/ตัวแทนที่เหนือกว่า',
            'last_ip' => 'ล็อกอินล่าสุดIP',
            'title_modify_money' => 'เปลี่ยนยอดสมาชิก',
            'title_assign_agent' => 'ตั้งเป็นพร็อกซี',
            'title_assign_member_agent' => 'ตั้งค่าบัญชีผู้ใช้【:name】สำหรับพร็อกซี',
            'title_modify_top' => 'มอบหมายพร็อกซี',
            'title_modify_member_top' => 'กำหนดหมายเลขบัญชี【:name 】ตัวแทนที่เหนือกว่า'
        ],
        'edit' => [
            'title_edit' => 'การแก้ไขสมาชิก',
            'title_create' => 'สมาชิกใหม่',
            'is_tips_on_notice' => 'ทุกครั้งที่ผู้เล่นเข้าสู่ระบบหลังจากเปิดใช้งานจะมีเสียงพื้นหลัง',
            'is_in_on_notice' => 'หลังจากเปิดแล้วสมาชิกจะชนะหรือแพ้โดยไม่บันทึกสถิติ'
        ],

        'member_apis' => [
            'title' => 'โควต้าอินเทอร์เฟซสมาชิก',
            'api_title' => 'ชื่ออินเตอร์เฟส',
            'money' => 'วงเงิน',
            'null' => 'ยังไม่เปิด',
            'refresh' => 'รีเฟรชยอดคงเหลือของอินเทอร',
            'recycle' => 'การรีไซเคิลด้วยคลิกเดียว',
        ],

        'modify_money' => [
            'title' => 'การปรับเปลี่ยนโควต้าสมาชิก',
            'is_add_ml' => 'เพิ่มจำนวนรหัสในเวลาเดียวกัน',
            'is_add_ml_notice' => 'เพิ่มการอ้างอิงอัตราส่วน 【ปรับแต่งระบบ】 - 【ตัวแทนที่เกี่ยวข้อง】 - 【เปอร์เซ็นต์การถอนเงิน】',
        ],

        'modify_top' => [
            'notice' => '<strong>ให้ความสนใจ：</strong> ไม่มีการตั้งค่าส่วนลดก่อนบัญชีนี้，หลังจากกำหนดผู้บังคับบัญชาแล้วคะแนนส่วนลดจะถูกกำหนดโดยอัตโนมัติตามบัญชีผู้บังคับบัญชาที่ได้รับมอบหมาย'
        ],

        'money_report' => [
            'title' => 'งบการเงิน',
            'notice' => '<strong>ให้ความสนใจ：：</strong> จำนวนบวกคือกำไรของแพลตฟอร์ม，ลบเป็นแพลตฟอร์มที่ขาดทุน',
            'created_at' => 'ช่วงเวลา',
            'is_agent_and_top_agent' => 'ตัวแทน/ผู้บังคับบัญชา',
            'recharge_count' => 'จำนวนเงินฝาก',
            'drawing_count' => 'จำนวนการถอนเงิน',
            'recharge_sum' => 'จำนวนเงินฝากทั้งหมด',
            'drawing_sum' => 'จำนวนเงินถอนทั้งหมด',
            'total_fs' => 'คืนน้ำทั้งหมด',
            'total_dividend' => 'เงินปันผลรวม',
            'total_other' => 'รวมอื่น ๆ',
            'total_profit' => 'กำไรและขาดทุนรวม',

            'profit_formula_notice' => 'สูตรการคำนวณกำไรและขาดทุนและคำอธิบาย',
            'profit_formula' => 'เงินฝาก—ถอนเงิน—กลับไปที่น้ำ—โบนัส-อื่นๆ＝กำไรและขาดทุนที่เกิดขึ้นจริง',
            'yinli' => 'กำไร：',
            'kuisun' => 'ขาดทุน：'
    	],

	    'msg' => [
	            'money_negative_error' => 'จำนวนเงินที่แก้ไขเป็นลบโปรดตรวจสอบ',
	            'password_at_least_6' => 'ความยาวรหัสผ่านอย่างน้อยหกบิต',
	            'balance_error' => 'แบบสอบถามยอดคงเหลือล้มเหลว，ข้อความผิดพลาด:',
	            'offline_success' => 'ได้รับการเป็นสมาชิก【 :name 】เตะออฟไลน์',
	            'member_offlined' => 'สมาชิก【 :name 】ออฟไลน์แล้ว',
	    ]
	],

    'agent' => [
        'field' => [
            "member_id" => "สมาชิกID",
            "agent_pc_uri" => "ลิงค์พร็อกซีพีซี",
            "agent_wap_uri" => "เชื่อมโยง WAP พร็อกซี",
            "agent_real_pc_url" => "ลิงค์พร็อกซีพีซี",
            "agent_real_wap_url" => "เชื่อมโยง WAP พร็อกซี",
            "agent_uri_pre" => "ส่วนนำหน้าลิงก์พร็อกซี",
            "apply_data" => "ข้อมูลการสมัคร",
            "remark" => "หมายเหตุ",
        ],

        'assign' => [
            'notice' => 'หมายเลขพร็อกซีก่อนหน้าของสมาชิกถูกลบโปรดเลือกสร้างพร็อกซีใหม่หรือใช้บัญชีพร็อกซีเก่า'
        ],

        'index' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> ตัวแทนใหม่โปรดตั้งค่าสมาชิกให้เป็นตัวแทนในรายชื่อสมาชิก',
            'btn_fd_rate' => 'จุดย้อนกลับ',
            'title_fd_rate' => 'ตัวแทน :name จุดย้อนกลับ',
            'btn_fd_record' => 'บันทึกจุดย้อนกลับ',
            'title_fd_record' => 'ตัวแทน :name บันทึกจุดย้อนกลับ',
        ],

        'msg' => [
            'assign_type_required' => 'โปรดเลือกโหมดการจัดสรร',
            'assign_operate_error' => 'การมอบหมายพร็อกซีล้มเหลว:',
            'assign_operate_success' => 'ตัวแทนการกระจายสำเร็จ',
        ]
    ],

    'user' => [
        'field' => [
            "name" => "ชื่อผู้ใช้",
            "password" => "รหัสผ่าน",
            "status" => 'สถานะ',
            "create_ip" => "สร้างไอพี",
            "google_secret" => "รหัสยืนยันของ Google",
            "is_google_secret" => "ไม่ว่าจะผูกรหัสยืนยันของ Google",
        ],

        'status' => [
            1 => 'ปกติ',
            -1 => 'ห้าม'
        ],

        'index' => [
            'btn_assgin' => 'กำหนดบทบาท'
        ],

        'modify_pwd' => [
            'oldpassword' => 'รหัสผ่านดั้งเดิม',
            'password' => 'รหัสผ่านใหม่',
            'password_confirmation' => 'ยืนยันรหัสผ่านใหม่',
        ],

        'assign' => [
            'role' => 'บทบาท'
        ],

        'msg' => [
            'oldpassword_error' => 'รหัสผ่านเดิมไม่ถูกต้องโปรดตรวจสอบ',
            'modify_success_login' => "แก้ไขรหัสผ่านเรียบร้อยแล้วโปรดเข้าสู่ระบบอีกครั้ง",
            'modify_error' => 'การแก้ไขรหัสผ่านล้มเหลว',
            'assign_success' => 'การกำหนดบทบาทสำเร็จ',
            'assign_fail' => 'การกำหนดบทบาทล้มเหลว',
        ],

        'login' => [
            'google_auth_error' => 'กรอกข้อผิดพลาดในการตรวจสอบรหัสของ Google',
        ],

        'google' => [
            'first_notice' => 'สำหรับการเชื่อมโยงครั้งแรกโปรดใช้ Google Verifier app เพื่อสแกนรหัส QR โดยตรงป้อนรหัสยืนยันของ Google บนโทรศัพท์ของคุณและส่งการเชื่อมโยง；',
            'reset_notice' => 'คุณได้ผูกรหัสยืนยันของ Google แล้วหากคุณต้องการเชื่อมโยงใหม่โปรดติดต่อผู้ดูแลระบบของคุณ',
            'scan_qrcode' => 'การผูกรหัสกวาด',
            'secret_notice' => 'โปรดป้อนรหัสยืนยันของ Google บนโทรศัพท์มือถือของคุณหลังจากสแกนรหัส',
            'submit' => 'ส่งการเชื่อมโยง',
            'reset_own_error' => 'ไม่สามารถรีเซ็ตบัญชีของคุณได้โปรดติดต่อหัวหน้าผู้ดูแลระบบ',
            'reset_btn' => 'รีเซ็ตรหัสยืนยันของ Google',
            'reset_message' => 'คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตรหัสยืนยันของ Google สำหรับบัญชีนี้',
        ]
    ],

    'role' => [
        'field' => [
            'name' => 'ชื่อผู้ใช้',
            'description' => 'รายละเอียด',
        ],

        'index' => [
            'btn_assign' => 'กำหนดสิทธิ์ที่อนุญาต',
        ],

        'assign' => [
            'permission' => 'สิทธิ์',
            'check_all' => 'เลือกทั้งหมด'
        ],

        'msg' => [
            'assign_success' => 'การกำหนดสิทธิ์สำเร็จ',
            'assign_fail' => 'การกำหนดสิทธิ์ล้มเหลว',
        ]
    ],

    'permission' => [
        'field' => [
            'name' => 'ชื่อสิทธิ์',
            'icon' => 'ไอคอน',
            'pid' => 'พาเรนต์ID',
            'route_name' => 'ชื่อเส้นทาง',
            'weight' => 'น้ำหนัก',
            'description' => 'รายละเอียด',
            'remark' => 'หมายเหตุ',
            'is_show' => 'แสดงว่า'
        ],

        'is_show' => [
            0 => 'ไม่แสดง',
            1 => 'แสดง'
        ],

        'index' => [
            'btn_child' => 'สร้างสิทธิ์ย่อย',
        ],

        'msg' => [
            'lang_json_error' => 'ข้อผิดพลาดในการกรอกชื่อสิทธิ์หลายภาษา'
        ]
    ],

    'black_ip' => [
        'field' => [
            "ip" => "IPที่อยู่",
            "is_open" => "จะเปิดหรือไม่",
            "remark" => "ข้อมูลหมายเหตุ",
        ]
    ],

    'apis' => [
        'field' => [
            "api_id" => "API ID",
            "api_name" => "การระบุแพลตฟอร์ม",
            "api_title" => "ชื่อคำอธิบายแพลตฟอร์ม",
            "api_money" => "ยอดคงเหลือของอินเตอร์เฟส",
            "prefix" => "คำนำหน้าบัญชี",
            "is_open" => "เปิดหรือไม่",
            "lang" => "สกุลเงิน",
            "lang_list" => "รองรับภาษา",
            "weight" => "น้ำหนัก",
            "remark" => "หมายเหตุ",
            'icon_url' => 'ไอคอนแถบด้านข้างอิเล็กทรอนิกส์',
            'logo_url' => 'พีซีแบบหล่นลงแสดงโลโก้'
        ],

        'index' => [
            'top_title' => 'APIการกำหนดค่าพื้นฐานของอินเตอร์เฟส',
            'api_domain' => 'ชื่อโดเมนพื้นฐาน',
            'api_prefix' => 'คำนำหน้า',
            'btn_refresh' => 'รีเฟรชยอดคงเหลือของอินเทอร',
            'config_title' => 'การกำหนดค่าพื้นฐานเว็บไซต์',
        ],

        'msg' => [
            'no_need_update_game' => 'ไม่จำเป็นต้องอัปเดตเกม',
            'update_game_success' => 'ปรับปรุงเรียบร้อยแล้ว【 :update_count 】ข้อมูลเกมประสบความสำเร็จในการเพิ่ม【 :create_count】ข้อมูลเกม',
        ]
    ],

    'api_game' => [
        'field' => [
            "title" => "ชื่อเกม",
            "subtitle" => "คำบรรยาย",
            "web_pic" => "ภาพด้านคอมพิวเตอร์",
            "mobile_pic" => "รูปภาพโทรศัพท์มือถือ",
            "api_name" => "ข้อมูลประจำตัวของอินเตอร์เฟส",
            "class_name" => "ตัวระบุสไตล์",
            "game_type" => "ประเภทเกม",
            "params" => "อาร์กิวเมนต์",
            "client_type" => "เรียกใช้แพลตฟอร์ม",
            "is_open" => "เปิดหรือไม่",
            "weight" => "น้ำหนัก",
            "tags" => "ป้ายกำกับ",
            "lang" => "ภาษา",
            "remark" => "หมายเหตุ",
        ],

        'index' => [
            'top_notice' => 'เกมแสดงข้อความในการแก้ไขดังกล่าว',
            'btn_update' => 'อัปเดตเกม',
            'web_pic_notice' => '【อิเล็กทรอนิกส์】รูปภาพที่จัดประเภทสอดคล้องกับรายการเกมLogo'
        ],

        'mobile_category' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> จำเป็นต้องบันทึกเพื่อให้มีผลหลังจากการดำเนินการ',
            'web_title' => 'การเรียงลำดับการนำทางหน้าแรกของคอมพิวเตอร์',
            'key' => 'การระบุตัวตน',
            'name' => 'ชื่อ',
            'weight' => 'น้ำหนัก',
        ]
    ],

    'game_list' => [
        'field' => [
            "api_name" => "ข้อมูลประจำตัวของอินเตอร์เฟส",
            "name" => "เกมชื่อภาษาจีน",
            "en_name" => "ชื่อภาษาอังกฤษ",
            "game_type" => "ประเภทเกม",
            "game_code" => "หมายเลขเกม",
            "tcg_game_type" => "ประเภทเกม TCG",
            "param_remark" => "การเพิ่มพารามิเตอร์",
            "img_path" => "พาธของภาพ",
            "img_url" => "ที่อยู่รูปภาพ",
            "client_type" => "เรียกใช้แพลตฟอร์ม",
            "platform" => "สภาพแวดล้อมที่รองรับ",
            "is_open" => "เปิดหรือไม่",
            "weight" => "น้ำหนัก",
            "tags" => "ป้ายกำกับ",
        ]
    ],

    'game_hot' => [
        'field' => [
            "name" => "ชื่อสำนักงาน",
            "api_name" => 'ชื่อผู้ใช้',
            "desc" => "รายละเอียดของห้องโถง",
            "en_name" => "ชื่อสำนักงาน[ภาษาอังกฤษ]",
            "en_desc" => "รายละเอียดของห้องโถง[ภาษาอังกฤษ]",
            "tw_name" => "ชื่อสำนักงาน[ซับซ้อน]",
            "tw_desc" => "รายละเอียดของห้องโถง[ซับซ้อน]",
            "th_name" => "ชื่อสำนักงาน[ภาษาไทย]",
            "th_desc" => "รายละเอียดของห้องโถง[ภาษาไทย]",
            "vi_name" => "ชื่อสำนักงาน[เวียดนาม•]",
            "vi_desc" => "รายละเอียดของห้องโถง[เวียดนาม•]",
            "icon_path" => "ก่อนเลือก icon",
            "icon_path2" => "หลังจากเลือก icon",
            "img_url" => "ที่อยู่ภาพ",
            "game_code" => "พารามิเตอร์เกม",
            "is_online" => "ไม่ว่าจะออนไลน์",
            "sort" => "อันดับ",
            'game_type' =>'ประเภทของเกม',
            'type' =>'ประเภทตำแหน่ง',
            "lang" => "ภาษา",
            'jump_link' =>'การเชื่อมโยงข้าม',
            'jump_link_p' => 'ถ้าเข้าเกมโดยตรงไม่ต้องกรอกข้อมูล',
            'icon_path2_p' => 'ถ้าคุณเลือกหน้าแรกเกมหมวดหมู่สถานที่ไม่ต้องอัพโหลด',
            'is_new_window' => 'จะเปิดในหน้าต่างใหม่หรือไม่'
        ],
        'hot_game_place_type' => [
            1 => 'ส่วนเกม',
            2 => 'หมวดหมู่เกมหน้าแรก'
        ],
    ],

    'admin_log' => [
        'field' => [
            'user_id' => 'ผู้ดูแลระบบID',
            'user_name' => 'ชื่อผู้ใช้ของผู้ดูแลระบบ',
            'url' => 'ที่อยู่ปฏิบัติการ',
            'data' => 'ข้อมูลปฏิบัติการ',
            'ip' => 'ปฏิบัติการIP',
            'address' => 'IPที่อยู่จริง',
            'ua' => 'สภาพแวดล้อมการทำงาน',
            'type' => 'ประเภทของการกระทำ',
            'type_text' => 'คำอธิบายประเภทการดำเนินงาน',
            'description' => 'รายละเอียดการดำเนินการ',
            'remark' => 'หมายเหตุปฏิบัติการ',
        ],

        'title' => [
            'login_title' => 'บันทึกการล็อกอินของผู้ดูแลระบบ',
            'logout_title' => 'บันทึกการออกจากระบบของผู้ดูแลระบบ',
            'operate_title' => 'บันทึกการทำงานของผู้ดูแลระบบ',
            'system_title' => 'บันทึกข้อยกเว้นของระบบ'
        ],

        'type' => [
            '1' => 'ล็อกอินพื้นหลัง',
            '2' => 'ออกจากระบบพื้นหลัง',
            '3' => 'ปฏิบัติการพื้นหลัง',
            '4' => 'ความผิดปกติของระบบ'
        ]
    ],

    'member_log' => [
        'field' => [
            "member_id" => "สมาชิกID",
            "ip" => "ปฏิบัติการIP",
            "address" => "IPที่อยู่จริง",
            "ua" => "สภาพแวดล้อมการทำงาน",
            "type" => "ประเภทของการกระทำ",
            "description" => "รายละเอียดการดำเนินการ",
            "remark" => "หมายเหตุ",
        ]
    ],

    'member_agent_apply' => [
        'field' => [
            "member_id" => "สมาชิกID",
            "name" => "ชื่อจริง",
            "phone" => "หมายเลขโทรศัพท์",
            "email" => "อีเมล",
            "msn_qq" => "ติดต่อMSN/QQ",
            "reason" => "เหตุผลในการสมัคร",
            "status" => "สถานะแอปพลิเคชัน",
            "fail_reason" => "สาเหตุของความล้มเหลว",
            "assign_type" => "โหมดการจัดสรร"
        ],

        'index' => [
            'btn_deal' => 'การประมวลผล'
        ],

        'msg' => [
            'saved_cannot_modify' => 'แอปพลิเคชันที่ตรวจสอบแล้วไม่อนุญาตให้มีการแก้ไข',
            'update_and_fill_data' => 'ข้อมูลการอัพเดทสำเร็จโปรดกรอกพารามิเตอร์พร็อกซี',
        ],
    ],

    'agent_fd_rate' => [
        'field' => [
            "parent_id" => "พร็อกซีพาเรนต์ID",
            "member_id" => "สมาชิกปัจจุบันID",
            "game_type" => "ประเภทเกม",
            "type" => "ประเภทจุด",
            "rate" => "อัตราส่วนลด(%)",
            "remark" => "หมายเหตุ",
        ],

        'agent' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> เอเจนต์ยังไม่ได้ตั้งค่าจุดย้อนกลับ',
            'operate_total' => 'จุดการตั้งค่าแบบครบวงจร',
            'btn_apply' => 'โปรแกรม',
            'title' => 'ตั้งค่าพร็อกซี【 :name 】จุดย้อนกลับ',
            'system_highest' => 'จุดสูงสุดของระบบ',
            'system_lowest' => 'จุดต่ำสุดของระบบ',
            'system_default' => 'จุดเริ่มต้นของระบบ',
            'quick_notice' => 'โปรดป้อนค่าของจุดการตั้งค่าแบบรวม'
        ],

        'system' => [
            'highest_title' => 'จุดส่งคืนสูงสุดเริ่มต้นของพร็อกซี',
            'lowest_title' => 'ส่วนลดต่ำสุดเริ่มต้นของพร็อกซี',
            'default_title' => 'ระบบสร้างพร็อกซีส่วนลดเริ่มต้น',
        ],

        'msg' => [
            'system_highest_error' => 'ประเภทเกมระบบ【 :game_type 】จุดต่อต้านน้ำสูงสุดต่ำกว่าจุดต่อต้านน้ำต่ำสุดของประเภทนี้，กรุณาตรวจสอบ',
            'system_lowest_error' => 'ประเภทเกมระบบ【 :game_type 】จุดต่อต้านน้ำต่ำสุดนั้นสูงกว่าจุดต่อต้านน้ำสูงสุดของประเภทนี้โปรดตรวจสอบ',
        ],
    ],

    'agent_fd_money_log' => [
        'field' => [
            "member_id" => "สมาชิกผู้เล่นID",
            "member_rate" => "อัตราส่วนผลตอบแทนผู้เล่น(%)",
            "agent_member_id" => "ตัวแทนID",
            "agent_member_rate" => "อัตราส่วนส่วนลดพร็อกซี(%)",
            "child_member_id" => "สมาชิกผู้ใต้บังคับบัญชาID",
            "child_member_rate" => "อัตราส่วนผลตอบแทนสมาชิกผู้ใต้บังคับบัญชา(%)",
            "game_type" => "ประเภทเกม",
            "bet_amount" => "จำนวนเงินเดิมพัน",
            "fd_money" => "จำนวนเงินคืน",
            "money_before" => "ยอดคงเหลือก่อนบันทึก",
            "money_after" => "ยอดคงเหลือหลังการบันทึก",
            "remark" => "หมายเหตุ",
        ]
    ],

    'daily_bonus' => [
        'field' => [
            "member_id" => "สมาชิกid",
            "bonus_money" => "ลงชื่อเข้าใช้จำนวนรางวัล",
            "days" => "จำนวนวันลงชื่อเข้าใช้",
            "serial_days" => "จำนวนวันลงชื่อเข้าใช้",
            "total_days" => "จำนวนวันลงชื่อเข้าใช้สะสม",
            "type" => "ประเภท",
            "state" => "สถานะ",
            "remark" => "หมายเหตุ",
            "lang" => "ภาษา/ สกุลเงิน"
        ],

        'record' => [
            'btn_confirm' => 'ผ่านการตรวจสอบ',
            'notice_confirm' => 'คุณแน่ใจหรือไม่ว่าจะสมัครผ่านรางวัลการลงชื่อเข้าใช้ของสมาชิก？',
            'btn_reject' => 'การตรวจสอบไม่ผ่าน',
            'notice_reject' => 'คุณแน่ใจหรือไม่ว่าจะปฏิเสธแอปพลิเคชันการลงชื่อเข้าใช้？',
        ],

        'setting' => [
            'deposit' => 'จำนวนเงินฝากในวันนั้น',
            'valid_num' => 'น้ำที่มีประสิทธิภาพ（ตัวคูณ）',
            'times' => 'ตัวคูณ',
            'is_open' => 'เปิดใช้งานหรือไม่'
        ],

        'msg' => [
            'same_day_error' => 'รางวัลการลงชื่อเข้าใช้สำหรับจำนวนวันการตั้งค่าการลงชื่อเข้าใช้เดียวกันได้ถูกตั้งค่าไว้แล้วโปรดตรวจสอบ'
        ]
    ],

    'game_record' => [
        'field' => [
            "billNo" => "หมายเหตุหมายเลขซีเรียลเดียว",
            "api_name" => "ข้อมูลประจำตัวของอินเตอร์เฟส",
            "name" => "บัญชีผู้เล่น",
            "gameType" => "ประเภทเกม",
            "status" => "สถานะการชำระบัญชี",
            "betTime" => "เวลาเดิมพัน",
            "betAmount" => "จำนวนเงินเดิมพัน",
            "validBetAmount" => "จำนวนเงินเดิมพันที่มีประสิทธิภาพ",
            "netAmount" => "จำนวนเงินที่จ่าย",
            "roundNo" => "ข้อมูลการแข่งขัน",
            "playDetail" => "รายละเอียดการเล่น",
            "wagerDetail" => "รายละเอียดการเดิมพัน",
            "gameResult" => "ผลรางวัล",
            "is_fd" => "ไม่ว่าจะเป็นส่วนลด",

            "shuyinAmount" => "จํานวนเงินที่แพ้หรือชนะ"
        ],

        'index' => [
            'btn_send_fd' => 'จ่ายเงินคืน',
            'notice_send_fd' => 'คุณแน่ใจหรือไม่ว่าจะออกการต่อต้านน้ำของบันทึกเกม?',

        ]
    ],

    'member_wheel' => [
        'field' => [
            "member_id" => "สมาชิกid",
            "user_id" => "ผู้ดูแลระบบID",
            "award_id" => "รางวัลID",
            "award_desc" => "รายละเอียดรางวัล",
            "status" => "รับสถานะ",
        ],

        'index' => [
            'btn_send' => 'ยืนยันการออก',
            'notice_send' => 'คุณแน่ใจหรือไม่ว่าจะยืนยันกระบวนการออก?'
        ],

        'setting' => [
            'deposit' => 'จำนวนเงินฝากในวันนั้น',
            'valid_num' => 'การไหลของน้ำที่มีประสิทธิภาพ หลาย',
            'times' => 'จำนวนแผ่นเสียง',
            'awards' => 'รางวัล',
            'is_open' => 'เปิดใช้งานหรือไม่'
        ]
    ],

    'system_notice' => [
        'field' => [
            "title" => "หัวเรื่อง",
            "content" => "เนื้อหา",
            "text_content" => "APP เนื้อหา",
            "group_name" => "ชื่อกลุ่ม",
            "weight" => "น้ำหนัก",
            "url" => "กระโดดไปยังลิงค์",
            "is_open" => "เปิดใช้งานหรือไม่",
            "lang" => "ภาษา",
        ],

        'index' => [
            'app_title' => 'APPรายการประกาศ'
        ],

        'edit' => [
            'notice_group' => 'การจัดกลุ่มที่มีอยู่แล้ว:'
        ]
    ],

    'system_config' => [
        'config_groups' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> จำเป็นต้องบันทึกหลังจากการดำเนินการจนกว่าจะมีผล คลิกที่ปุ่มรีเฟรชทางด้านขวาเพื่อรีเฟรช',
            'system' => 'ที่เกี่ยวข้องกับระบบ',
            'service' => 'บริการลูกค้า',
            'line' => 'Line',
            'site' => 'ชื่อเว็บไซต์',
            'activity' => 'เกี่ยวข้องกับกิจกรรม',
            'recharge' => 'เกี่ยวข้องกับการจ่ายเงิน',
            'drawing' => 'เกี่ยวข้องกับการถอนเงิน',
            'agent' => 'ตัวแทนที่เกี่ยวข้อง',
            'notice' => 'การแจ้งเตือนที่เกี่ยวข้อง',
            'group_notice' => '<strong>ให้ความสนใจ：</strong> หลังจากบันทึกเนื้อหาของหน้านี้แล้วคุณต้องรีเฟรชทั้งหน้าเพื่อให้มีผล',
            'btn_choose' => 'เลือกแฟ้ม',
            'btn_preview' => 'แสดงตัวอย่าง',
			'register'	=> 'ลงทะเบียน',
        ],

        'app_content' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> จำเป็นต้องบันทึกเพื่อให้มีผลหลังจากการดำเนินการเสร็จสิ้น',
            'app_content' => 'เนื้อหาที่เกี่ยวข้อง'
        ],

        'config_content' => [
            'register' => 'เกี่ยวข้องกับการลงทะเบียน',
            'navigate' => 'การนำทางที่เกี่ยวข้อง',
            'activity_about' => 'เกี่ยวข้องกับกิจกรรม',
            'credit' => 'ที่เกี่ยวข้องกับการยืม',
            'levelup_slot' => 'อัพเกรดอิเล็กทรอนิกส์',
            'levelup_live' => 'อัพเกรดคนจริง'
        ],
    ],

    'banner' => [
        'field' => [
            "id" => "ID",
            "title" => "หัวเรื่อง",
            "description" => "รายละเอียด",
            "url" => "ที่อยู่",
            "dimensions" => "กว้างและสูง",
            "groups" => "จัดกลุ่ม",
            "weight" => "น้ำหนัก",
            "lang" => "ภาษา",
            "is_open" => "จะเปิดหรือไม่",
            "created_at" => "สร้างเวลา",
            "updated_at" => "ปรับปรุงเวลา",
        ],

        'index' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> จะไม่ถูกลบเมื่อลบไดอะแกรมการหมุนในรายการ”การจัดการสิ่งที่แนบมาด้วย“อัปโหลดบันทึกและไฟล์;ขนาดอ้างอิง：webสิ้นสุดขนาดล้อ【1920*418】，h5端【750*350】',
        ],

        'edit' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> โปรดรักษาขนาดของภาพกลุ่มเดียวกันให้มีขนาดเท่ากัน',
            'group_notice' => 'กรุณากรอกแบบฟอร์มโทรศัพท์มือถือ“mobile1”,PCกรุณากรอกแบบฟอร์มการออกอากาศ“new1”'
        ]
    ],

    'about' => [
        'field' => [
            "id" => "ID",
            "title" => "หัวเรื่อง",
            "subtitle" => "คำบรรยาย",
            "cover_img" => "ภาพปก",
            "content" => "เนื้อหา",
            "type" => "ประเภท",
            "is_open" => "เปิดหรือไม่",
            "is_hot" => "ถ้าร้อน",
            "weight" => "น้ำหนัก",
            "lang" => "ภาษา",
        ]
    ],

    'sport' => [
        'field' => [
            "home_team_name" => "ชื่อทีมเจ้าบ้าน",
            "home_team_name_en" => "ชื่อทีมเจ้าบ้านภาษาอังกฤษ",
            "home_team_img" => "ภาพทีมเจ้าบ้าน",
            "home_odds" => "อัตราต่อรองของทีมเจ้าบ้าน",
            "visiting_team_name" => "ชื่อทีมเยือน",
            "visiting_team_name_en" => "เยี่ยมชมชื่อทีมภาษาอังกฤษ",
            "visiting_team_img" => "ผู้เข้าชมภาพ",
            "visiting_odds" => "อัตราต่อรองของทีมเยือน",
            "let_ball" => "ปล่อยลูกบอล",
            "match_cup" => "ชื่อการแข่งขัน",
            "match_cup_en" => "ชื่อการแข่งขันภาษาอังกฤษ",
            "match_at" => "เวลาการแข่งขัน",
            "is_open" => "จะเปิดหรือไม่",
            "weight" => "น้ำหนัก",
        ]
    ],

    'level_config' => [
        'field' => [
            "level" => "ระดับ",
            "level_name" => "ชื่อระดับ",
            "deposit_money" => "จำนวนเงินฝากส่งเสริมการขาย",
            "bet_money" => "จำนวนเงินเดิมพันโปรโมชั่น",
            "level_bonus" => "ของขวัญส่งเสริมการขาย",
            "day_bonus" => "ของขวัญรายวัน",
            "week_bonus" => "ของขวัญรายสัปดาห์",
            "month_bonus" => "ของขวัญรายเดือน",
            "year_bonus" => "ของขวัญประจำปี",
            "credit_bonus" => "ยืมรางวัลโควต้า",
            "levelup_type" => "ประเภทเงื่อนไขการส่งเสริมการขาย",
            "lang" => "ภาษา/ สกุลเงิน",
        ]
    ],

    'payment' => [
        'field' => [
            "desc" => "คำอธิบายวิธีการชำระเงิน",
            "account" => "บัญชีผู้รับเงิน",
            "type" => "วิธีการชำระเงิน",
            "name" => "ชื่อผู้รับเงิน",
            "qrcode" => "จ่ายรหัสสองมิติ",
            "memo" => "หมายเหตุการชำระเงิน",
            "rate" => "อัตราส่วนของขวัญ",
            "min" => "จำนวนเงินเติมเงินขั้นต่ำ",
            "max" => "จำนวนเงินเติมเงินสูงสุด",
            "forex" => "สัดส่วนการซื้อขาย",
            "lang" => "ภาษา/ สกุลเงิน",
            "is_open" => "จะเปิดหรือไม่",

            "detail" => "รายละเอียด",
            "range" => "ขีด จำกัด เดียว",
            "bank_type" => "ประเภทธนาคาร",
            "bank_address" => "ที่อยู่ธนาคาร",
            "account_id" => "หมายเลขร้านค้าบุคคลที่สาม",
            "key" => "คีย์บุคคลที่สาม",
            "url" => "การชำระเงินของบุคคลที่สามURL",
            "api" => "โลโก้การชำระเงินของบุคคลที่สาม",
            "paytype" => "รหัสประเภทการชำระเงินของบุคคลที่สาม",
            "usdt_type" => "USDT ชนิดของ",
            "usdt_rate" => "USDT อัตราแลกเปลี่ยน",
            "usdt_num" => "USDT ปริมาณ"
        ],

        "index" => [
            'top_notice' => 'กรุณาใส่ชื่อและข้อมูลแนะนำของหน้าวิธีการฝากเงิน【ปรับแต่งระบบ】 - 【การจัดกลุ่มการกำหนดค่าระบบ】 - 【เกี่ยวข้องกับการจ่ายเงิน】 ปรับแต่ง'
        ],

        "edit" => [
            "notice_memo" => "ข้อมูลหมายเหตุที่ต้องกรอกเมื่อชำระเงิน",
            "notice_range" => "เมื่อจำนวนเงินเติมเงินขั้นต่ำและจำนวนเงินเติมเงินสูงสุดเป็น 0 หมายความว่าไม่มีการ จำกัด จำนวนเงินเติมเงิน",
            "notice_min_max" => "จำนวนขั้นต่ำของการเติมเงินและจำนวนสูงสุดของการเติมเงินจะขึ้นอยู่กับจำนวนของแพลตฟอร์ม",
            "notice_forex" => "จำนวนแพลตฟอร์มที่มีจำนวนการแลกเปลี่ยน 1 ต้องใช้，รายการดังนี้: จำนวนแพลตฟอร์มที่มีจำนวนการแลกเปลี่ยน 10，ด้านล่าง\"ภาษา/สกุลเงิน\"เลือกภาษาจีนเติมอัตราส่วนการทำธุรกรรม 10",
        ],

        'msg' => [
            'account_id_required' => 'กรุณาใส่หมายเลขธุรกิจของบุคคลที่สาม',
            'key_required' => 'กรุณาใส่กุญแจของบุคคลที่สาม',
            'url_required' => 'โปรดป้อนที่อยู่ URL การชำระเงินของบุคคลที่สาม',
            'bank_type_required' => 'กรุณาเลือกประเภทบัตรเครดิตธนาคาร',
            'account_required' => 'กรุณาใส่บัญชีลูกหนี้',
            'name_required' => 'กรุณาใส่ชื่อผู้รับเงิน',
            'money_range_err' => 'จำนวนเงินเติมเงินสูงสุดต้องไม่ต่ำกว่าจำนวนเงินเติมเงินขั้นต่ำ',
            'usdt_account_required' => 'โปรดป้อนบัญชีรับ USDT',
            'usdt_rate_required' => 'โปรดป้อนอัตราแลกเปลี่ยน USDT',
            'usdt_rate_valid' => 'โปรดป้อนอัตราแลกเปลี่ยน USDT ที่ถูกต้อง',
        ]
    ],

    'activity' => [
        'field' => [
            "title" => "หัวเรื่อง",
            "subtitle" => "คำบรรยาย",
            "cover_image" => "ปกรายการ",
            "content" => "รายละเอียดกิจกรรม",
            "type" => "ประเภทกิจกรรม",
            "apply_type" => "วิธีการสมัคร",
            "apply_url" => "ที่อยู่ของแอปพลิเคชัน",
            "apply_desc" => "คำอธิบายแอปพลิเคชัน",
            "hall_image" => "แผนที่ปกล็อบบี้",
            "hall_field" => "สมัครเพื่อกรอกข้อมูล",
            "date_desc" => "คำอธิบายเวลากิจกรรม",
            "date_description" => "เวลาของกิจกรรม",
            "start_at" => "เวลาเริ่มกิจกรรม",
            "end_at" => "กำหนดเวลากิจกรรม",
            "rule_content" => "กฏของกิจกรรม",
            "is_open" => "เปิดหรือไม่",
            "is_hot" => "ถ้าร้อน",
            "weight" => "น้ำหนัก",
            "lang" => "ภาษา",
        ],

        'index' => [
            'btn_preview' => 'แสดงตัวอย่าง'
        ],

        'msg' => [
            'hall_image_required' => 'กรุณาอัปโหลดภาพปกของห้องโถงกิจกรรม',
            'apply_url_required' => 'กรุณากรอกที่อยู่การข้ามแอปพลิเคชันกิจกรรม'
        ]
    ],

    'activity_apply' => [
        'field' => [
            "member_id" => "สมาชิกid",
            "user_id" => "ผู้ดูแลระบบID",
            "activity_id" => "กิจกรรมID",
            "data_content" => "ข้อมูลการสมัคร",
            "status" => "สถานะแอปพลิเคชัน",
            "remark" => "ข้อมูลหมายเหตุ",

            "money" => "จำนวนเงินที่จ่าย"
        ],

        'index' => [
            'btn_confirm' => 'ผ่านการตรวจสอบ',
            'btn_reject' => 'การตรวจสอบไม่ผ่าน',
            'notice_confirm' => 'คุณแน่ใจหรือไม่ว่าจะสมัครผ่านกิจกรรมของสมาชิก',
            'notice_reject' => 'คุณแน่ใจหรือไม่ว่าจะปฏิเสธใบสมัครรางวัลการลงชื่อเข้าใช้ของสมาชิก',
            'btn_bonus' => 'แจกรางวัลกิจกรรม'
        ],

        'edit' => [
            'title_confirm' => 'ผ่านการตรวจสอบ',
            'title_reject' => 'การตรวจสอบไม่ผ่าน',
            'top_notice' => '<strong>ให้ความสนใจ：</strong> หากคุณต้องการแจกจ่ายรางวัลโปรดดำเนินการหลังจากผ่านการตรวจสอบแล้ว',
            'dealed_error' => 'บันทึกแอปพลิเคชันได้รับการประมวลผลโปรดอย่าทำซ้ำการประมวลผล',
        ],

        'bonus' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> จำนวนกิจกรรมจะถูกส่งไปยังบัญชีต่อต้านน้ำโดยค่าเริ่มต้น',
            'money_notice' => 'กรุณาส่งกระเป๋าไปที่ ตั้งค่าระบบ - เกี่ยวข้องกับกิจกรรม ตั้งค่า'
        ]
    ],

    'modify_pwd' => [
        'field' => [
            "oldpassword" => 'รหัสผ่านดั้งเดิม',
            "password" => 'รหัสผ่านใหม่',
            "password_confirmation" => 'ยืนยันรหัสผ่านใหม่',

            "qk_pwd" => 'รหัสผ่านการถอนเงินใหม่',
            "old_qk_pwd" => 'รหัสผ่านการถอนเงินดั้งเดิม',
            "qk_pwd_confirmation" => 'ยืนยันรหัสผ่านการถอนเงินใหม่'
        ]
    ],

    'register' => [
        'field' => [
            'name' => 'บัญชีผู้ใช้',
            'password' => 'รหัสผ่าน',
            'password_confirmation' => 'ยืนยันรหัสผ่าน',
            'rates' => 'อัตราส่วนลด'
        ]
    ],

    'memberbank' => [
        'field' => [
            "member_id" => "สมาชิกID",
            "card_no" => "หมายเลขบัตร",
            "bank_type" => "ประเภทธนาคาร",
            "bank_type_text" => "ประเภทธนาคาร",
            "phone" => "ทำบัตรจองหมายเลขโทรศัพท์มือถือ",
            "owner_name" => "ชื่อผู้ถือบัตร",
            "bank_address" => "ที่อยู่ธนาคาร",
            "remark" => "หมายเหตุปฏิบัติการ",
        ],

        'index' => [
            'title' => ''
        ]
    ],

    'recharge' => [
        'field' => [
            "bill_no" => "หมายเลขซีเรียลการค้า",
            "member_id" => "สมาชิกid",
            "name" => "ชื่อผู้โอนเงิน",
            "account" => "โอนบัญชี",
            "origin_money" => "จำนวนเงินเติมเงินก่อนการแปลง",
            "forex" => "อัตราส่วนการทำธุรกรรม การแปลง",
            "money" => "จำนวนเงินเติมเงิน",
            "lang" => "ภาษา/ สกุลเงิน",
            "payment_type" => "ประเภทการชำระเงิน",
            "payment_pic" => "ใบสำคัญจ่าย",
            "diff_money" => "จํานวนเงินที่ได้รับ",
            "before_money" => "จำนวนเงินก่อนเติมเงิน",
            "after_money" => "จำนวนเงินที่เติมเงิน",
            "score" => "คะแนน",
            "fail_reason" => "สาเหตุของความล้มเหลว",
            "hk_at" => "เวลาการโอนเงินที่กรอกโดยลูกค้า",
            "confirm_at" => "ยืนยันเวลาโอน",
            "status" => "สถานะการชำระเงิน",
            "user_id" => "ผู้ดูแลระบบID",

            'payment_id' => 'ข้อมูลใบเสร็จรับเงิน',
            'payment_account' => 'บัญชีผู้รับเงิน',
            'payment_name' => 'ชื่อผู้รับเงิน',
            'bank_type' => 'ธนาคารรับเงิน'
        ],

        'index' => [
            'btn_confirm' => "ผ่านการตรวจสอบ",
            'btn_reject' => "การตรวจสอบไม่ผ่าน",
            'btn_payment_detail' => "รายละเอียดบัญชีการชำระเงิน"
        ],

        'edit' => [
            'notice_diff' => "ช่องทางการชำระเงิน :text อัตราส่วนของขวัญคือ :rate"
        ],

        'msg' => [
            'recharge_dealed' => 'บันทึกการเติมเงินได้รับการประมวลผลแล้ว',
        ]
    ],

    'drawing' => [
        'field' => [
            "bill_no" => "หมายเลขซีเรียลการค้า",
            "member_id" => "สมาชิกID",
            "name" => "ชื่อผู้รับเงิน",
            "money" => "จำนวนเงินที่ถอน",
            "account" => "ข้อมูลบัญชีผู้ใช้",
            "before_money" => "จำนวนเงินก่อนถอน",
            "after_money" => "จำนวนเงินหลังจากถอน",
            "score" => "คะแนน",
            "counter_fee" => "ค่าธรรมเนียม",
            "fail_reason" => "สาเหตุของความล้มเหลว",
            "member_bank_info" => "ข้อมูลธนาคารผู้ใช้json",
            "member_remark" => "หมายเหตุการถอนเงินของผู้ใช้",
            "confirm_at" => "ยืนยันเวลาโอน",
            "status" => "สถานะการถอนเงิน",
            "user_id" => "ผู้ดูแลระบบID",
        ],

        'index' => [
            'btn_confirm' => 'ผ่านการตรวจสอบ',
            'btn_reject' => 'การตรวจสอบไม่ผ่าน'
        ],

        'msg' => [
            'dealed_error' => 'แอปพลิเคชันการถอนได้รับการดำเนินการแล้ว'
        ]
    ],

    'message' => [
        'field' => [
            "user_id" => "ผู้ดูแลระบบID",
            "pid" => "ข้อความล่าสุดID",
            "url" => "กระโดดURL",
            "title" => "ชื่อสถานี",
            "content" => "ส่งเนื้อหา",
            "visible_type" => "ประเภทที่มองเห็นได้",
            "send_type" => "ประเภทการส่ง",
        ],

        'index' => [
            'visible_member' => 'สมาชิกที่มองเห็นได้',
            'all_member' => 'สมาชิกทั้งหมด',
        ],

        'msg' => [
            'member_select_required' => 'โปรดเลือกสมาชิกที่จะส่ง',
            'data_select_required' => 'โปรดเลือกข้อมูลที่คุณต้องการใช้งาน',
        ]
    ],

    'member_message' => [
        'field' => [
            'title' => 'ชื่อความคิดเห็นของสมาชิก',
            'content' => 'ความคิดเห็นของสมาชิก',
            'reply_title' => 'ตอบกลับไปยังหัวเรื่อง',
            'reply_content' => 'ตอบกลับเนื้อหา',
            'status' => 'สถานะการตอบกลับ'
        ],

        'index' => [
            'btn_batch_read' => 'อ่านแบทช์แล้ว',
            'btn_detail' => 'รายละเอียดความคิดเห็น',
            'btn_reply' => 'จดหมายตอบกลับ',
            'btn_mark' => 'ทำเครื่องหมายตอบกลับ',
            'title_mark' => 'คุณแน่ใจหรือว่าจะทำการประมวลผลการตอบกลับแท?',
            'title_delete' => 'คุณแน่ใจหรือว่าจะลบการตอบกลับนี้'
        ],

        'history' => [
            'title' => 'รายละเอียดความคิดเห็น',
        ],
    ],

    'member_money_log' => [
        'field' => [
            "member_id" => "สมาชิกID",
            "user_id" => "ผู้ดูแลระบบID",
            "money" => "จำนวนการดำเนินการ",
            "money_before" => "จำนวนเงินก่อนการดำเนินการ",
            "money_after" => "จำนวนเงินหลังการดำเนินการ",
            "money_type" => "ประเภทฟิลด์จำนวนเงิน",
            "number_type" => "ประเภทตัวเลข",
            "operate_type" => "ประเภทการเปลี่ยนแปลงจำนวนเงิน",
            "model_name" => "ชื่อรุ่น",
            "model_id" => "แบบจำลองID",
            "description" => "รายละเอียดการดำเนินการ",
            "remark" => "หมายเหตุปฏิบัติการ",
        ],

        'notice' => [
            'activity_bonus' => 'แจกจ่ายกิจกรรม【 :title 】โบนัส【 :money หยวน】ถึงสมาชิก【 :member 】',
            'system_send_fs' => 'ช่วงเวลาที่ออกโดยผู้ดูแลระบบ【 :time 】ประเภทเกม【 :game_type 】กระเป๋าเงินป้องกันน้ำถึงป้องกันน้ำ',
            'drawing_reject' => 'ไม่ถอนเงินสดโดยสมาชิก，จะมีจำนวนเงิน【 :money หยวน】ส่งคืนไปยังบัญชีสมาชิก，เหตุผลในการปฏิเสธ：:reason',
            'drawing_counter_fee' => '，จำนวนรหัสสมาชิกคือ【 :ml_money 】,หักค่าธรรมเนียมการจัดการ【 :count_feeหยวน】',
            'drawing_request' => 'จำนวนเงินสดสุดท้ายของสมาชิกคือ【 :money 】',
            'get_fs_now' => 'วันที่รับ【 :time 】ต่อต้านน้ำก่อนหน้า，จำนวนเงินคือ【 :money 】，ประเภทเกม【 :game_type】，แจกจ่ายให้กับกระเป๋าเงินป้องกันน้ำ',

            'transfer_in_game' => 'โอน【 :title 】เกม【 :money หยวน】，หักจำนวนบัญชี',
            'transfer_in_error' => 'โอน【 :title 】เกมล้มเหลว，คืนเงินจำนวนบัญชี【 :money หยวน】',
            'transfer_out_game' => 'ย้ายออก【 :title 】เกม【 :money หยวน】，เพิ่มจำนวนบัญชี'
        ]
    ],

    'yuebao_plan' => [
        'field' => [
            "SettingName" => "ชื่อโปรแกรม",
            "MinAmount" => "จำนวนการซื้อขั้นต่ำ",
            "MaxAmount" => "จำนวนการซื้อสูงสุด",
            "SettleTime" => "เวลาชำระบัญชี（ชั่วโมง）",
            "IsCycleSettle" => "วิธีการชำระเงิน",
            "Rate" => "อัตราดอกเบี้ยของโปรแกรม",
            "TotalCount" => "จำนวนเงินตามแผนทั้งหมด",
            "LimitInterest" => "ดอกเบี้ยสูงสุดของสมาชิก",
            "LimitOrderIntervalTime" => "ช่วงเวลาการสั่งซื้อ（ชั่วโมง）",
            "InterestAuditMultiple" => "จำนวนรหัสดอกเบี้ย",
            "LimitUserOrderCount" => "จำนวนการซื้อสูงสุดของสมาชิก",
            "is_open" => "จะเปิดให้ซื้อ",
            "weight" => "เรียงลำดับ",
        ],

        'edit' => [
            'notice_no_limit' => 'ไม่กรอกข้อมูลหมายความว่าไม่มีข้อ จำกัด',
            'notice_default_ml' => 'ค่าปริยายคือ 1 เท่าของจำนวนรหัส',
            'notice_weight' => 'ยิ่งพิงก่อน'
        ],

        'member_plan' => [
            'created_at' => 'เวลาซื้อ'
        ],

        'msg' => [
            'min_money_err' => 'จำนวนการซื้อขั้นต่ำต้องไม่สูงกว่าจำนวนการซื้อขั้นต่ำ',
            'max_money_err' => 'จำนวนการซื้อสูงสุดต้องไม่สูงกว่าจำนวนเงินทั้งหมดที่วางแผนไว้',
        ]
    ],

    'member_yuebao_plan' => [
        'field' => [
            "member_id" => "สมาชิกid",
            "plan_id" => "โปรแกรมID",
            "amount" => "จํานวนเงินที่ซื้อ",
            "status" => "สถานะ",
            "drawing_at" => "เวลาถอนเงินสด",

            "interest_sum" => "ดอกเบี้ยสะสม",
        ],

        'index' => [
            'title_interest_history' => 'บันทึกกำไร - 【 :name 】'
        ]
    ],

    'interest_history' => [
        'field' => [
            "member_plan_id" => "โปรแกรมสมาชิกID",
            "interest" => "ดอกเบี้ย",
            "times" => "จำนวนครั้ง",
            "calc_at" => "เวลาชำระบัญชี",
        ]
    ],

    'credit_pay_record' => [
        'field' => [
            "member_id" => "สมาชิกid",
            "money" => "จำนวนเงินกู้",
            "type" => "ประเภท",
            "borrow_day" => "วันยืม",
            "status" => "สถานะ",
            "dead_at" => "เวลาหมดอายุของเงินกู้",

            "is_overdue" => "ไม่ว่าจะเกินกำหนด"
        ],

        'index' => [
            'btn_confirm' => 'ผ่าน',
            'notice_confirm' => 'คุณแน่ใจหรือไม่ว่าจะดำเนินการยืมผ่านสมาชิก',
            'btn_reject' => 'คุณแน่ใจหรือไม่ว่าจะปฏิเสธการดำเนินการยืมของสมาชิก',
            'notice_reject' => 'ปฏิเสธ',

            'title_lend' => 'บันทึกการชำระคืน',
            'title_borrow' => 'บันทึกการยืม',
        ]
    ],

    'quick' => [
        'member_arbitrage_query' => [
            'arbitrage_type' => 'ประเภท Arbitrage',
            'result' => 'ผลลัพธ์ของแบบสอบถาม',
            'total_number' => 'จำนวนทั้งหมด',
            'no_result' => 'ไม่มีข้อมูลที่เกี่ยวข้อง'
        ],

        'transfer_check' => [
            'start_at' => 'เวลาเริ่มต้น',
            'end_at' => 'กำหนดเวลา',
            'transfer_out_account' => 'โอนออกจากบัญชีผู้ใช้',
            'transfer_in_account' => 'โอนไปยังบัญชีผู้ใช้',
            'money' => 'จำนวนเงินที่โอน',
            'is_dd' => 'จะออกเดี่ยว',
            'btn_supply' => 'เพียงเติมแผ่น',
            'btn_supply_modify' => 'เติมคำสั่งซื้อและแก้ไขยอดคงเหลือ',

            'no_transfer_data' => 'S̄māchik rāy nī̂ mị̀mī bạnthụk kār pæ lng kho wt̂ā rah̄ẁāng [: Start_at ~: End_at]',
            'transfer_count_success' => 'สมาชิกรายนี้มีบันทึก [: count] ระหว่าง [: start_at ~: end_at] และยังไม่ทิ้งคำสั่งซื้อ',
            'transfer_count_fail' => 'มีคำสั่งซื้อ fail_count ในระเบียน [: count] ระหว่าง [: start_at ~: end_at]',
            'money_not_enough' => 'ยอดคงเหลือสมาชิกไม่เพียงพอโปรดตรวจสอบ',
        ],

        'database_clean' => [
            'top_notice' => '<strong>ให้ความสนใจ：</strong> การดำเนินการกลับไม่ได้โปรดระมัดระวัง;【แบบฟอร์มการเป็นสมาชิก】และ【บันทึกค่าคอมมิชชั่นตัวแทน】ไม่สามารถลบได้ตามชื่อสมาชิก，โดยเฉพาะ วันล้างข้อมูล กำลังทำการลบ；<br><b>เช่นการลบบันทึกเกมสมาชิก，จะส่งผลให้สูญเสียข้อมูลผลประโยชน์ระดับโปรโมชั่น<b>；',
            'member_notice' => 'จะส่งผลให้สูญเสียข้อมูลผลประโยชน์ระดับโปรโมชั่น',
            'content' => 'ล้างเนื้อหา',

            'member' => 'แบบฟอร์มการเป็นสมาชิก',
            'agent' => 'ตารางพร็อกซี',
            'agent_fd_money_log' => 'บันทึกจำนวนเงินส่วนลดพร็อกซี',
            'agent_yj_log' => 'บันทึกค่าคอมมิชชั่นตัวแทน',
            'drawing' => 'บันทึกการถอนเงิน',
            'game_record' => 'บันทึกเกมสมาชิก',
            'member_money_log' => 'บันทึกจำนวนสมาชิก',
            'recharge' => 'บันทึกการเติมเงิน',
            'transfer' => 'บันทึกการแปลงโควต้า',
            'member_log' => 'บันทึกการทำงานของสมาชิก',
            'member_wheel' => 'บันทึกรูเล็ตสมาชิก',
            'daily_bonus' => 'บันทึกการลงชื่อสมาชิก',
            'member_yuebao_plan' => 'บันทึกยอดคงเหลือสมาชิก',
            'credit_pay_record' => 'บันทึกการยืมสมาชิก',
            'activity' => 'รายการกิจกรรม',
            'activity_apply' => 'แอปพลิเคชันกิจกรรมสมาชิก',

            'oldest_date' => 'วันที่ข้อมูลที่เก่าที่สุด',
            'latest_date' => 'วันที่ข้อมูลล่าสุด',
            'day_before' => ':date วันก่อน',

            'day_field' => 'ล้างข้อมูลกี่วันที่ผ่านมา',
            'days' => 'ล้างข้อมูลวัน',
            'day_notice' => 'ล้างข้อมูลโดยค่าเริ่มต้นเป็นเวลา 30 วัน',

            'alert_before' => 'เลือกที่จะทำความสะอาดเนื้อหา',
            'alert_after' => 'ยืนยันการทำความสะอาด',
            'alert_title' => 'คำแนะนำในการปฏิบัติการ',
            'alert_1' => 'ผมจะไปดู',
            'alert_2' => 'ฉันได้อ่านข้อความสีแดงด้านบนและทำความสะอาดต่อไป',

            'item_select_required' => 'โปรดเลือกรายการล้างข้อมูล',
        ],
    ],

    'yj_level' => [
        'field' => [
            'level' => 'ระดับคอมมิชชั่น',
            'name' => 'ชื่อเกรด',
            'active_num' => 'จำนวนออฟไลน์ที่ใช้งาน',
            'min' => 'มูลค่าการซื้อขายขั้นต่ำ',
            'rate' => 'อัตราค่าคอมมิชชั่น (ร้อยละ)',
            "lang" => "สกุลเงิน",
        ],

        'msg' => [
            'top_notice' => 'หมายเหตุ: เกณฑ์สำหรับสมาชิกออฟไลน์ที่ใช้งานอยู่คือยอดเติมเงินรายเดือนถึง [:money] หยวน หากคุณต้องการแก้ไข โปรดแก้ไขในหน้า [การกำหนดค่าระบบ]-[กลุ่มการกำหนดค่าระบบ]-[ที่เกี่ยวข้องกับตัวแทน]'
        ]
    ],

    'agent_yj_log' => [
        'field' => [
            'created_at' => 'ช่วงเวลาคอมมิชชั่น',
            'top_title' => 'งบการเงินหน่วยงาน',

            'offline' => 'สมาชิกดาวน์ไลน์',
            'balance' => 'ยอดออฟไลน์',
            'transfer' => 'ฝาก-ถอน เป็นประจำ Regular',
            'deposit' => 'เงินฝาก',
            'withdraw' => 'การถอนเงิน',
            'bonus' => 'การกระจายโบนัส',
            'activity' => 'ของขวัญกิจกรรม',
            'rebate' => 'ป้องกันน้ำส่ง',
            'other' => 'สถานการณ์อื่นๆ',
            'last_at' => 'เวลาคอมมิชชั่นล่าสุด',
            'money' => 'ค่าคอมมิชชั่น',
            'remark' => 'ข้อสังเกตของคณะกรรมการ',

            'send_yj' => 'ค่าคอมมิชชั่นการกระจาย',
            'record' => 'การบันทึก',
            'history' => '【:name】ประวัติการจ่ายค่าคอมมิชชั่น',
        ],

        'msg' => [
            'top_notice' => 'หมายเหตุ: ค่าคอมมิชชั่นของเอเจนซีเป็นรูปแบบของเอเจนซี่ดั้งเดิมซึ่งควบคุมโดยผู้ดูแลระบบ โดยหลักการแล้ว จะออกเดือนละครั้ง',

            'time_range_required' => 'โปรดเลือกช่วงเวลาค่าคอมมิชชั่นก่อน',
            'yj_send_success' => 'ค่าคอมมิชชั่นที่ประสบความสำเร็จ',
            'yj_send_fail' => 'การออกค่าคอมมิชชั่นล้มเหลว:',
        ]
    ],

    'send_fs' => [
        'msg' => [
            'realtime_fs_mode' => 'ขณะนี้เป็นโหมดต่อต้านน้ำแบบเรียลไทม์ไม่สามารถใช้ฟังก์ชั่นป้องกันน้ำแบบคลิกเดียว',
            'send_success' => 'การกระจายน้ำที่ประสบความสำเร็จ',
            'send_fail' => 'การแจกจ่ายน้ำย้อนกลับล้มเหลว:',
        ]
    ],

    'transfer' => [
        'field' => [
            "bill_no" => "หมายเลขซีเรียลการค้า",
            "api_name" => "ข้อมูลประจำตัวของอินเตอร์เฟส",
            "member_id" => "สมาชิกID",
            "transfer_type" => "ประเภทการโอนเงิน",
            "money" => "จำนวนเงินที่แปลงแล้ว",
            "diff_money" => "ความแตกต่าง（โบนัส）จำนวนเงิน",
            "real_money" => "จำนวนการแปลงจริง",
            "before_money" => "จำนวนเงินก่อนโอน",
            "after_money" => "จำนวนเงินหลังการโอน",
            "money_type" => "ประเภทฟิลด์จำนวนเงิน",
        ],
    ],

    'fs_level' => [
        'field' => [
            "game_type" => "ประเภทเกม",
            "member_id" => "สมาชิกID",
            "level" => "ระดับน้ำย้อนกลับ",
            "name" => "ชื่อระดับ",
            "quota" => "โควต้าการเดิมพันที่มีประสิทธิภาพ",
            "type" => "ประเภท",
            "rate" => "อัตราส่วนน้ำย้อนกลับ",
            "lang" => "ภาษา/ สกุลเงิน"
        ],

        'msg' => [
            'select_member' => 'กรุณาเลือกสมาชิก',
            'same_data_not_allowed' => 'สามารถมีข้อมูลได้เพียงข้อมูลเดียวสำหรับประเภทเกมประเภทระดับและสกุลเงินเดียวกัน',
            'fs_level_required' => 'โปรดตั้งค่าชื่อระดับ',
            'fs_level_repeat' => 'ข้อมูลระดับน้ำย้อนกลับสำหรับระดับนี้มีอยู่แล้วโปรดลบออกและดำเนินการ',
        ],
    ],

    'aside_adv' => [
        'field' => [
            'name' => 'ชื่อ',
            'group' => 'ชื่อกลุ่ม',
            'pic_url' => 'ภาพโฆษณา',
            'pic_index' => 'ดัชนีรูปภาพ',
            'vertical' => 'ตำแหน่งแนวตั้ง',
            'horizontal' => 'ตำแหน่งแนวนอน',
            'effect' => 'เทคนิคพิเศษ',
            'url_id' => 'เส้นทางกระโดด',
            'remark' => 'ข้อมูลข้อสังเกต',
            'lang' => 'ภาษา',
            'is_open' => 'เปิดมั้ย',
            'weight' => 'เรียงลำดับ',
        ],
    ],

    'option' => [
        'member_status' => [
            1 => 'เปิดใช้งาน',
            -1 => 'ปิดการใช้งาน',
            -2 => 'เตะออฟไลน์'
        ],
        'game_type' => [
            1 => 'คนจริง',
            2 => 'ตกปลา',
            3 => 'อิเล็กทรอนิกส์',
            4 => 'ลอตเตอรี่',
            5 => 'กีฬา',
            6 => 'หมากรุก',
            7 => 'อื่นๆ',
            99 => 'ระบบหวย'
        ],

        'activity_type' => [
            1 => 'กิจกรรมคืนน้ำ',
            2 => 'กิจกรรมการจ่ายเงินปันผล',
            3 => 'กิจกรรมการเติมเงิน',
            4 => 'แสดงกิจกรรม'
        ],

        'activity_is_apply' => [
            1 => 'จำเป็นต้องสมัคร',
            0 => 'ไม่ต้องใช้'
        ],

        'activity_apply_type' => [
            0 => 'ไม่ต้องใช้',
            1 => 'ติดต่อฝ่ายบริการลูกค้า',
            2 => 'แอพพลิเคชั่นห้องโถงกิจกรรม',
            3 => 'ข้ามไปดูรายละเอียด'
        ],

        'activity_apply_field' => [
            'member_name' => 'ชื่อผู้ใช้ของสมาชิก',
            'recharge_money' => 'จำนวนเงินฝาก',
            'game_type' => 'ประเภทเกม',
            'api_game_type' => 'หมวดหมู่ย่อยของเกม',//(接口 + 游戏类型),
            'bill_no' => 'หมายเหตุหมายเลขเดียว',
        ],

        'activity_apply_status' => [
            0 => 'รอการตรวจสอบ',
            1 => 'ผ่านการตรวจสอบ',
            2 => 'การตรวจสอบไม่ผ่าน',
            3 => 'ข้อเสนอที่ได้รับการออก'
        ],

        'is_open' => [
            1 => 'เปิด',
            0 => 'ปิด'
        ],

        'is_read' => [
            1 => 'อ่านแล้ว',
            0 => 'ยังไม่ได้อ่าน'
        ],

        'boolean' => [
            1 => 'ใช่',
            0 => 'ไม่'
        ],

        'gender' => [
            0 => 'ชาย',
            1 => 'ผู้หญิง'
        ],

        'member_money_type' => [
            'money' => 'ยอดคงเหลือกระเป๋าเงินส่วนกลาง',
            'fs_money' => 'ยอดคงเหลือกระเป๋าเงินคืน',
            'total_money' => 'จำนวนเงินเดิมพันแพลตฟอร์มทั้งหมด',
            'score' => 'คะแนนสมาชิก',
            'ml_money' => 'ยอดคงเหลือของรหัส',
            'total_credit' => 'จำนวนเงินทั้งหมดที่ยืมมา',
            'used_credit' => 'ยืมโควต้าที่ใช้ไปแล้ว'
        ],

        'member_money_operate_type' => [
            1 => 'ปฏิบัติการของผู้ดูแลระบบ',
            2 => 'ระบบของขวัญ',
            3 => 'เกมถูกถ่ายโอน / ย้ายออก',
            4 => 'ส่งคืนน้ำ',
            5 => 'ลงชื่อเข้าใช้สำหรับกิจกรรม',
            6 => 'กิจกรรมการเติมเงิน',
            7 => 'โบนัสแพลตฟอร์ม',
            8 => 'คว้าซองจดหมายสีแดง',
            9 => 'เติมเงิน / ถอนเงินสด',
            10 => 'เติมเงินของขวัญ',
            11 => 'ปฏิเสธที่จะถอนเงิน',
            12 => 'การถ่ายโอนไปยังเกมล้มเหลวในการส่งคืน',
            13 => 'การกระจายกิจกรรม',
            14 => 'ตัวแทนค่าคอมมิชชั่น',
            15 => 'แผ่นเสียงลุ้นรางวัล',
            16 => 'ซื้อผลิตภัณฑ์การบริหารความมั่งคั่ง',
            17 => 'เงินปันผลผลิตภัณฑ์การบริหารความมั่งคั่ง',
            18 => 'ส่งคืนคำสั่งซื้อ/หัก',
            19 => 'การไถ่ถอนผลิตภัณฑ์การบริหารความมั่งคั่ง',
            20 => 'โปรโมชั่นรางวัล',
            21 => 'โจวเงินเดือน',
            22 => 'เดือนเงินเดือน',
            23 => 'ยืมเงิน',
            24 => 'การชำระคืนเงินกู้',
            25 => 'ของขวัญรายวัน',
            26 => 'ของขวัญรายสัปดาห์',
            27 => 'ของขวัญรายเดือน',
            28 => 'ของขวัญประจำปี',
            29 => 'ของขวัญส่งเสริมการขาย',
        ],

        'levelup_types' => [
            1 => 'จำนวนเงินฝากเป็นไปตามมาตรฐาน',
            2 => 'จำนวนเงินเดิมพัน',
            3 => 'มาตรฐานใด ๆ',
            4 => 'มาตรฐานทั้งหมด',
        ],

        'money_number_type' => [
            1 => 'เพิ่ม',
            -1 => 'ลด'
        ],

        'card_type' => [
            1 => 'บัตรเงินฝากออมทรัพย์',
        ],

        'agent_assign_types' => [
            1 => 'สร้างใหม่',
            2 => 'ใช้ตัวแทนเก่า'
        ],

        'feedback_type' => [
            1 => 'ปัญหาแพลตฟอร์ม',
            2 => 'ปัญหาทางการเงิน',
            3 => 'ให้คำแนะนำ'
        ],

        'about_type' => [
            1 => "เกี่ยวกับเรา",
            2 => "ช่วยฝากเงิน",
            3 => "ความช่วยเหลือในการถอนเงิน",
            4 => "คำถามที่พบบ่อย",
            5 => "พันธมิตร",
            6 => "ข้อตกลงร่วมทุน",
            7 => "ติดต่อเรา",
            8 => "เงื่อนไขและข้อตกลง"
        ],

        'gamerecord_status' => [
            'N' => 'ยกเลิกแล้ว',
            'X' => 'ยังไม่ได้ชำระ',
            'COMPLETE' => 'ชำระบัญชีแล้ว',
            'CANCEL' => 'ยกเลิกแล้ว',
        ],

        'client_type' => [
            0 => 'รองรับคอมพิวเตอร์มือถือ',
            1 => 'pc',
            2 => 'phone'
        ],

        'tag_type' => [
            'hot' => 'ร้อน',
            'recommend' => 'แนะนำ',
            'new' => 'ล่าสุด',
        ],

        'apply_status' => [
            0 => 'รอการตรวจสอบ',
            1 => 'ผ่านการตรวจสอบ',
            2 => 'การตรวจสอบไม่ผ่าน'
        ],

        'recharge_status' => [
            1 => 'รอการยืนยัน',
            2 => 'เติมเงินสำเร็จ',
            3 => 'การเติมเงินล้มเหลว'
        ],

        'drawing_status' => [
            1 => 'รอการยืนยัน',
            2 => 'ถอนเงินเรียบร้อยแล้ว',
            3 => 'การถอนเงินล้มเหลว'
        ],

        'recharge_type' => [
            1 => 'จ่ายสมบัติ',
            2 => 'จดหมายไมโคร',
            3 => 'โอนเงินผ่านธนาคาร',
            4 => 'การชำระเงินของบุคคลที่สาม',
            5 => 'QQ',
            6 => 'เร็ว-จดหมายไมโคร',
            7 => 'เร็ว-จ่ายสมบัติ'
        ],

        'payment_type' => [
            'online_alipay' => 'การชำระเงิน Alipay(ชำระเงินออนไลน์)',
            'online_wechat' => 'จ่ายจดหมายไมโคร(ชำระเงินออนไลน์)',
            'online_union_quick' => 'ทางลัด UnionPay(ชำระเงินออนไลน์)',
            'online_union_scan' => 'สแกนรหัส UnionPay(ชำระเงินออนไลน์)',
            'company_bankpay' => 'โอนบัตรเครดิตธนาคาร(เงินเข้าบริษัท)',
            'company_alipay' => 'การชำระเงิน Alipay(เงินเข้าบริษัท)',
            'company_wechat' => 'WeChat การชำระเงินสาธารณะ(เงินเข้าบริษัท)',
            'online_cgpay' => 'CGPay (ชำระเงินออนไลน์)',
            'company_usdt' => 'USDT (เงินเข้าบริษัท)',
            'online_usdt' => 'USDT (ชำระเงินออนไลน์)',
        ],

        'transfer_type' => [
            1 => 'ถ่ายโอนไปยังเกม',
            2 => 'ย้ายออกจากเกม'
        ],

        // 消息可见性类型
        'message_visible_type' => [
            1 => 'สมาชิกทุกคนสามารถมองเห็นได้',
            2 => 'สมาชิกคนเดียวสามารถมองเห็นได้',
            3 => 'ผู้ดูแลระบบสามารถมองเห็นได้'
        ],

        // 消息发送类型
        'message_send_type' => [
            1 => 'ผู้ดูแลระบบส่ง',
            2 => 'ส่งโดยสมาชิก'
        ],

        'message_status' => [
            0 => 'รอการตอบกลับ',
            1 => 'ตอบกลับแล้ว',
            2 => 'ทำเครื่องหมายตอบกลับ'
        ],

        // 签到类型 负数表示设置，正数表示领奖
        'daily_bonus_type' => [
            -2 => 'รางวัลการลงชื่อเข้าใช้อย่างต่อเนื่อง',
            -1 => 'รางวัลการลงชื่อเข้าใช้สะสม',
            0 => 'เช็คอินทั่วไป',
            1 => 'ลงชื่อเข้าใช้เพื่อรับรางวัลสะสม',
            2 => 'ลงชื่อเข้าใช้อย่างต่อเนื่องเพื่อรับรางวัล'
        ],

        'daily_bonus_set' => [
            -1 => 'ลงชื่อเข้าใช้สะสม',
            -2 => 'ลงชื่อเข้าใช้อย่างต่อเนื่อง'
        ],

        'daily_bonus_state' => [
            0 => 'รอการยืนยัน',
            1 => 'ยืนยันแล้ว',
            -1 => 'ถูกปฏิเสธ'
        ],

        'member_log_type' => [
            1 => 'ล็อกอินสมาชิก',
            2 => 'สมาชิกออกจากระบบ',
            3 => 'การดำเนินงานของสมาชิก',
            4 => 'ล็อกอินพื้นหลังพร็อกซี',
            5 => 'ออกจากระบบพื้นหลังพร็อกซี',
            6 => 'ข้อยกเว้นอินเทอร์เฟซการโอนสมาชิก',
            7 => 'การตรวจสอบการลงทะเบียนสมาชิก SMS'
        ],

        'task_condition_types' => [
            1 => 'เติมเงินครั้งเดียว',
            2 => 'เติมเงินสะสม',
            3 => 'การถอนเงินสะสม',
            4 => 'กำไรสะสม',
            5 => 'ขาดทุนสะสม',
            6 => 'น้ำไหลสะสม'
        ],

        'task_award_type' => [
            1 => 'รางวัลชื่อ',
            2 => 'รางวัลจำนวนเงิน',
            3 => 'ส่วนลดค่าตอบแทน',
            4 => 'รางวัลวงเงินเครดิต'
        ],

        'level_award_type' => [
            'level_award' => 'ของขวัญระดับ',
            'week_award' => 'โจวเงินเดือน',
            'month_award' => 'เดือนเงินเดือน',
            'name_award' => 'รางวัลชื่อ',
            'borrow_award' => 'รางวัลวงเงินเครดิต'
        ],

        'fs_type' => [
            1 => 'ระดับน้ำย้อนกลับของระบบ',
            2 => 'ระดับการต่อต้านน้ำของสมาชิก'
        ],

        'member_task_status' => [
            1 => 'ในการรับ',
            2 => 'เสร็จสิ้นแล้ว'
        ],

        'agent_rate_type' => [
            3 => 'ตัวแทน/คะแนนสมาชิก',
            4 => 'จุดเริ่มต้นสำหรับพร็อกซีออฟไลน์'
        ],

        'config_money_type' => [
            'money' => 'กระเป๋าคุมข้อมูลส่วนกลาง',
            'fs_money' => 'กระเป๋าเงินคืนน้ำ',
        ],

        'arbitrage_conditions' => [
            'ip' => 'เหมือนกันIP',
            'psw' => 'รหัสผ่านเดียวกัน',
            'phone' => 'หมายเลขโทรศัพท์เดียวกัน',
            'card' => 'ชื่อบัญชีธนาคารเดียวกัน'
        ],

        'wheel_awards' => [
            1 => ['desc' => '500 รับ 100 คูปอง','type' => 2,'pic' => 'web/images/wheel/zh_cn/2ead44b68b93b0677b2cffe04cdf08d3.png'],
            2 => ['desc' => '฿28','type' => 1,'pic' => 'web/images/wheel/zh_cn/34bacd7183d7e2b95845d2c48e27d10c.png'],
            3 => ['desc' => '100 รับ 20 คูปอง','type' => 2,'pic' => 'web/images/wheel/zh_cn/bd8dd02713d3ac8705b38f1602de04a4.png'],
            4 => ['desc' => '฿58','type' => 1,'pic' => 'web/images/wheel/zh_cn/96b56053b67e5216b8d2c07562344e56.png'],
            5 => ['desc' => 'ทัวร์ฮ่องกงและมาเก๊า 5 วัน','type' => 3,'pic' => 'web/images/wheel/zh_cn/295c5965c9ed549937c3cf5942ccb897.png'],
            6 => ['desc' => '฿88','type' => 1,'pic' => 'web/images/wheel/zh_cn/11f2d5122249b7d1adb166ceffdb197e.png'],
            7 => ['desc' => '5,000 รับ 1,000 คูปอง','type' => 2,'pic' => 'web/images/wheel/zh_cn/b07eedbdf8cdf5b89b8d004d0b8e3f37.png'],
            8 => ['desc' => '฿18','type' => 1,'pic' => 'web/images/wheel/zh_cn/447075995668a5e04b0bf60885be216e.png'],
            9 => ['desc' => 'IPHONE 12 PRO MAX 512GB','type' => 3,'pic' => 'web/images/wheel/zh_cn/957740284f61bba05611061782f8d639.png'],
            10 => ['desc' => '1,000 รับ 300 คูปอง','type' => 2,'pic' => 'web/images/wheel/zh_cn/9019cab46b10bc82ab6ba6a94d6beb3c.png'],
            11 => ['desc' => 'ทัวร์ 7 วันสุดหรูในเอเชียตะวันออกเฉียงใต้','type' => 3,'pic' => 'web/images/wheel/zh_cn/835cfc99c3e77309c238612972996253.png'],
            12 => ['desc' => '฿8','type' => 1,'pic' => 'web/images/wheel/zh_cn/939d617c97f3a372980f3362245b3b5c.png']
        ],

        'wheel_status' => [
            1 => 'รอการชำระเงิน',
            2 => 'ออกแล้ว',
            3 => 'แจกจ่ายโดยตรง'
        ],

        'yuebao_settle_type' => [
            0 => 'การชำระเงินครั้งเดียว',
            1 => 'การตั้งถิ่นฐานเป็นวงกลม'
        ],

        'yuebao_member_status' => [
            0 => 'กำลังดำเนินการ',
            1 => 'จบแล้ว'
        ],

        'quick_url_type' => [
            'web' => 'WEBหน้า',
            'index' => 'หน้าแยกต่างหาก',
            'mobile' => 'หน้ามือถือ'
        ],

        'adv_vertical' => [
            'top' => 'บน',
            'bottom' => 'ด้านล่าง',
        ],

        'adv_horizontal' => [
            'left' => 'ซ้าย',
            'right' => 'ขวา'
        ],

        'adv_effect' => [
            'hover' => 'ช่วงล่าง'
        ],

        "notice_type" => [
            "voice" => "เสียงเตือนเท่านั้น",
            "alert" => "แจ้งเตือนป๊อปอัพเท่านั้น",
            "voice_and_alert" => "การแจ้งเตือนเสียงและการแจ้งเตือนป๊อปอัพ"
        ],

        "is_online" => [
            1 => 'ออนไลน์',
            0 => 'ออฟไลน์'
        ],

        "credit_type" => [
            'borrow' => 'การกู้ยืมเงิน',
            'lend' => 'ชำระคืน'
        ],

        "credit_status" => [
            1 => 'รอการยืนยัน',
            2 => 'การกู้ยืมที่ประสบความสำเร็จ',
            3 => 'ปฏิเสธที่จะยืม',
            4 => 'การชำระคืนสำเร็จ'
        ],

        'levelup_type' => [
            7 => 'อัพเกรดอิเล็กทรอนิกส์',
            8 => 'อัปเกรดสด'
        ],

        'notice_group' => [
            'main' => '首页公告',
            'credit' => '借呗公告',
            'pc' => '电脑弹窗',
            'mobile' => '手机弹窗'
        ],

        'register_setting_field' => [
            'isInviteCodeRequired' => 'รุ่นคอมพิวเตอร์จำเป็นต้องกรอกรหัสเชิญหรือไม่',
            'isRealNameRequred' => 'รุ่นคอมพิวเตอร์จำเป็นต้องกรอกชื่อจริงหรือไม่',
            'isPhoneRequired' => 'รุ่นคอมพิวเตอร์จะต้องกรอกหมายเลขโทรศัพท์มือถือ',
            'isCaptchaRequired' => 'รุ่นคอมพิวเตอร์จะต้องกรอกรหัสยืนยัน',

            'isInviteCodeRequired_mobile' => 'รุ่นมือถือจะต้องกรอกรหัสเชิญ',
            'isRealNameRequred_mobile' => 'รุ่นมือถือจะต้องกรอกชื่อจริง',
            'isPhoneRequired_mobile' => 'รุ่นมือถือจะต้องกรอกหมายเลขโทรศัพท์มือถือ',
            'isCaptchaRequired_mobile' => 'รุ่นมือถือจะต้องกรอกรหัสยืนยัน',
        ],

        'web_nav' => [
            "index" => "หน้าแรก",
            "slot" => "ความบันเทิงอิเลคทรอนิคส์",
            "poker" => "เกมหมากรุก",
            "casino" => "วิดีโอสด",
            "lottery" => "เกมลอตเตอรี",
            "sport" => "การแข่งขันกีฬา",
            "fish" => "เกมตกปลา",
            // "e_sport" => "电子竞技",
            "activity" => "โปรโมชั่น",
            "app" => "โทรศัพท์มือถือAPP",
            "service" => "บริการลูกค้าออนไลน์"
        ],

        'member_apis' => 'ยอดคงเหลือของอินเตอร์เฟส',
        'recharges' => 'บันทึกการเติมเงิน',
        'drawings' => 'บันทึกการถอนเงิน',
        'transfers' => 'บันทึกการโอนเงิน',
        'gamerecords' => 'บันทึกเกม',
        'memberlogs' => 'บันทึกการล็อกอิน',
        'modify_money' => 'เปลี่ยนยอดคงเหลือ',
        'arbitrage_query' => 'แบบสอบถาม Arbitrage',
        'make_offline' => 'เตะออฟไลน์',
        'make_offline_msg' => 'คุณแน่ใจหรือว่าจะเตะสมาชิกออฟไลน์？',

    ],

    // 接口相关文字
    'api' => [
        'common' => [
            'demo_not_allowed' => 'บัญชีตัวอย่างไม่สามารถทำสิ่งนี้ได้',
            'member_forbidden' => 'บัญชีถูกปิดการใช้งาน',
            'operate_error' => 'ปฏิบัติการผิดปกติ',
            'operate_fail' => 'การดำเนินการล้มเหลว：',
            'operate_forbidden' => 'คำขอที่ผิดกฎหมาย',
            'operate_again' => 'การดำเนินการล้มเหลว，โปรดลองใหม่อีกครั้ง',
            'operate_success' => 'ปฏิบัติการสำเร็จ',
            'member_not_exist' => 'ไม่มีข้อมูลสมาชิก',
            'net_again_err' => 'เครือข่ายผิดพลาด，โปรดลองใหม่อีกครั้ง',
            'err_code' => 'รหัสผิดพลาด：',
            'err_msg' => 'ข้อความผิดพลาด：',
            'money_desc' => ':money หยวน',
			'server_error' => 'ข้อผิดพลาดภายในเซิร์ฟเวอร์',
            'phone_not_exist' => 'ไม่มีหมายเลขโทรศัพท์',
            'phone_existed' => 'มีหมายเลขโทรศัพท์อยู่แล้ว',
        ],

        'index' => [
            'main_advertise_title_1' => 'โปรโมชั่นสำหรับสมาชิกใหม่',
            'main_advertise_title_2' => 'โปรโมชั่นสำหรับเกมสล็อต',
            'main_advertise_title_3' => 'โปรโมชั่นสำหรับคาสิโน',

            'main_advertise_sub_title_1' => 'โปรโมชั่นสําหรับ VIP',
            'main_advertise_sub_title_2' => 'โปรโมชั่น25% สำหรับเกมสล็อต',
            'main_advertise_sub_title_3' => 'สมาชิกฝากครั้งแรก รับโบนัสฟรี30%',

            'hotgame_sub_title_1' => 'เกมไก่ชนของไทยได้รับการคุ้มครองอย่างเต็มที่และรูปแบบการเล่นมีความหลากหลายและสนุกสนานให้คุณได้รับความบันเทิงจากเกมชนไก่ที่มีอยู่มากมายในเครือข่ายทั้งหมด',
            'hotgame_sub_title_2' => 'ด้วยหัวใจสำคัญของงานฝีมือเราจะมอบประสบการณ์การเล่นเกมที่ดีที่สุดให้กับผู้เล่น เงินรางวัลสะสมสิบล้านอยู่ไม่ไกลเกินเอื้อมรอให้คุณเปิดตัว',
            'hotgame_sub_title_3' => 'ด้วยหัวใจสำคัญของงานฝีมือเราจะมอบประสบการณ์การเล่นเกมที่ดีที่สุดให้กับผู้เล่น เงินรางวัลสะสมสิบล้านอยู่ไม่ไกลเกินเอื้อมรอให้คุณเปิดตัว',
        ],

        'lottery' => [
            'OTHERS' => 'อื่น ๆ',
        ],

        'sms' => [
            'code_required' => 'กรุณากรอกข้อมูลใน SMS รหัสการตรวจสอบ',
            'code_get_first' => 'กรุณารับ SMS รหัสการตรวจสอบ',
            'code_expired' => 'รหัสยืนยัน SMS หมดอายุแล้วโปรดรับอีกครั้ง',
            'code_error' => 'กรอกรหัสยืนยัน SMS ไม่ถูกต้องโปรดลองอีกครั้ง',
            'operation_repeat' => 'ได้รับรหัสยืนยันภายในสองนาทีโปรดอย่าใช้งานบ่อย',
        ],

        'apply_agent' => [
            'member_is_agent' => 'คุณเป็นตัวแทนอยู่แล้ว，ไม่ต้องสมัคร',
            'has_applied' => 'คุณได้ส่งใบสมัครแล้ว，โปรดอดใจรอ',
            'apply_success' => 'การส่งแอปพลิเคชันสำเร็จ',
            'apply_fail' => 'การส่งแอปพลิเคชันล้มเหลว，โปรดลองใหม่อีกครั้ง',
            'status_fail' => 'คุณยังไม่ได้สมัครตัวแทน',
            'not_agent' => 'คุณยังไม่ได้เป็นตัวแทน'
        ],

        'member_bank' => [
            'create_success' => 'การสร้างข้อมูลธนาคารสำเร็จ',
            'create_fail' => 'การสร้างข้อมูลธนาคารล้มเหลว，โปรดลองใหม่อีกครั้ง',
            'update_success' => 'การอัพเดทข้อมูลธนาคารสำเร็จ',
            'update_fail' => 'การอัพเดทข้อมูลธนาคารล้มเหลว，โปรดลองใหม่อีกครั้ง',
            'delete_success' => 'การลบข้อมูลธนาคารสำเร็จ',
            'delete_fail' => 'การลบข้อมูลธนาคารล้มเหลว，โปรดลองใหม่อีกครั้ง'
        ],

        'recharge' => [
            'payment_closed' => 'ช่องทางการชำระเงินถูกปิด，โปรดเลือกใหม่',
            'pay_between' => 'ช่วงของจำนวนเงินที่โอนคือ :min ~ :max หยวน，กรุณาตรวจสอบ',
            'pay_success' => 'ส่งเรียบร้อยแล้ว，กรุณาจ่าย',
            'payment_change' => 'ข้อมูลการเรียกเก็บเงินมีการเปลี่ยนแปลง，กรุณาส่งอีกครั้ง',
            'pay_normal_success' => "แอปพลิเคชันการเติมเงินถูกส่งเรียบร้อยแล้ว，โปรดรอให้ผู้ดูแลระบบตรวจสอบ",
            'pay_normal_fail' => "การส่งแอปพลิเคชันการเติมเงินล้มเหลว，โปรดลองใหม่อีกครั้ง",

            'not_third_pay' => 'วิธีการชำระเงินไม่ใช่การชำระเงินของบุคคลที่สาม',
            'param_not_all' => 'พารามิเตอร์ไม่สมบูรณ์',
            'config_err' => 'ข้อผิดพลาดการกำหนดค่าการชำระเงินของบุคคลที่สาม',

            'pay_money_err' => 'โปรดป้อนจำนวนจำนวนเต็มของอัตราส่วนการทำธุรกรรม',
        ],

        'drawing' => [
            'qk_pwd_required' => 'โปรดป้อนรหัสผ่านการถอนที่ถูกต้อง',
            'qk_pwd_error' => 'ข้อผิดพลาดในการป้อนรหัสผ่านการถอน，โปรดลองใหม่อีกครั้ง',
            'money_not_enough' => 'จำนวนเงินถอนมากกว่าจำนวนเงินที่มีอยู่，โปรดแก้ไข',
            'bank_not_exist' => 'ไม่มีข้อมูลบัตรเครดิตธนาคาร，กรุณาตรวจสอบ',
            'time_not_allow' => 'ไม่สามารถถอนเงินได้ในเวลาปัจจุบัน',
            'min_money' => 'จำนวนเงินที่ถอนน้อยกว่าจำนวนเงินที่ถอนขั้นต่ำ :min',
            'max_money' => 'จำนวนเงินถอนสูงกว่าจำนวนเงินถอนสูงสุด :max',
            'times_not_enough' => 'จำนวนแอปพลิเคชันการถอนเงินในวันนี้เกินขีด จำกัด，โปรดกลับมาพรุ่งนี้',
            'drawing_success' => 'แอปพลิเคชันการถอนเงินถูกส่งเรียบร้อยแล้ว，โปรดรอให้ผู้ดูแลระบบตรวจสอบ',
            'drawing_fail' => 'การส่งคำขอถอนเงินล้มเหลว，โปรดลองใหม่อีกครั้ง:',
            'ml_calc_err' => 'ข้อผิดพลาดในการคำนวณจำนวนรหัส：'
        ],

        'message' => [
            'send_success' => 'การส่งจดหมายภายในสถานีสำเร็จ，โปรดรอให้ผู้ดูแลระบบตอบกลับ',
            'send_fail' => 'การส่งจดหมายภายในสถานีล้มเหลว，โปรดลองใหม่อีกครั้ง',
            'update_success' => 'อัปเดตสถานะจดหมายภายในสถานีเป็น：',
            'update_fail' => 'การอัพเดตสถานะจดหมายภายในสถานีล้มเหลว',
            'delete_success' => 'การลบจดหมายในไซต์สำเร็จ',
            'delete_fail' => 'การลบจดหมายภายในสถานีล้มเหลว'
        ],

        'modify_pwd' => [
            'password_error' => 'รหัสผ่านต้นฉบับผิดพลาด，กรุณาตรวจสอบ',
            'password_success' => 'แก้ไขรหัสผ่านสำเร็จ',
            'password_fail' => 'การแก้ไขรหัสผ่านล้มเหลว',

            'qk_pwd_set' => 'คุณได้ตั้งรหัสผ่านการถอนเงินแล้ว，ไม่จำเป็นต้องตั้งค่าอีกครั้ง',
            'qk_pwd_success' => 'ตั้งรหัสผ่านการถอนเรียบร้อยแล้ว',
            'qk_pwd_fail' => 'การตั้งค่ารหัสผ่านการถอนล้มเหลว',
            'qk_pwd_error' => 'รหัสผ่านการถอนเงินต้นฉบับไม่ถูกต้อง，กรุณาตรวจสอบ',
            'qk_pwd_set_success' => 'แก้ไขรหัสผ่านการถอนเรียบร้อยแล้ว',
            'qk_pwd_set_fail' => 'การแก้ไขรหัสผ่านการถอนล้มเหลว'
        ],

        'redbag' => [
            'not_open' => 'คุณสมบัตินี้ถูกปิด',
            'no_times' => 'วันนี้คว้าซองจดหมายสีแดงจำนวนได้ถึงขีดจำกัด，โปรดกลับมาพรุ่งนี้',
            'success' => 'ยินดีด้วย，คว้าจำนวนเงิน :money หยวนสีแดง，โปรดตรวจสอบบัญชีในบันทึกการทำธุรกรรม'
        ],

        'dailybonus' => [
            'not_open' => 'ฟังก์ชั่นการเช็คอินยังไม่เปิด',
            'no_times' => 'วันนี้คุณได้ลงชื่อเข้าใช้，ไม่จำเป็นต้องลงชื่อเข้าใช้อีกครั้ง',
            'success' => 'การลงชื่อเข้าใช้สำเร็จ',
            'fail' => 'การเช็คอินล้มเหลว',
            'check_day_not_enough' => 'ไม่เป็นไปตามข้อกำหนดการรวบรวม，กรุณาตรวจสอบ',
            'check_repeat' => 'คุณได้รับรางวัลการลงชื่อเข้าใช้หรือในแอปพลิเคชัน，อย่าทำซ้ำหรือสมัคร',
            'check_success' => 'ลงชื่อรับรางวัลที่ประสบความสําเร็จ',
            'check_admin_check' => 'ลงชื่อเข้าใช้แอปพลิเคชันที่ส่งเรียบร้อยแล้ว，โปรดรอให้ผู้ดูแลระบบตรวจสอบ',
            'get_bonus_success' => 'สมาชิก【 :name 】รับรางวัลการลงชื่อเข้าใช้【฿ :money】',
        ],

        'fs_now' => [
            'get_success' => 'ต่อต้านน้ำได้รับความสำเร็จแบบเรียลไทม์，โปรดตรวจสอบรายละเอียดในบันทึกการทำธุรกรรม',
            'fs_level_err' => 'ไม่มีการกำหนดค่าระดับน้ำย้อนกลับ，กรุณาติดต่อฝ่ายบริการลูกค้า',
            'fs_no_data' => 'ไม่มีส่วนลดในการเรียกร้อง',
            'fs_not_open' => 'ฟีเจอร์นี้ยังไม่เปิด',
            'fs_repeat' => 'เก็บน้ำนิ่งส่วนนี้แล้ว ห้ามทำซ้ำ'
        ],

        'yuebao' => [
            'plan_require' => 'กรุณาเลือกซื้อโซลูชั่น',
            'amount_regex' => 'จำนวนการซื้อจะต้องเป็นทวีคูณของ 10',
            'plan_not_exist' => 'แผนการซื้อไม่มีอยู่',
            'plan_sold_out' => 'โปรแกรมถูกขายหมดแล้ว',
            'no_enough_amount' => 'ปริมาณการซื้อเกินขีด จำกัด สูงสุด，โปรดลองใหม่อีกครั้ง',
            'member_no_money' => 'ยอดเงินในบัญชีไม่เพียงพอ，กรุณาเติมเงิน',
            'success' => 'ซื้อสำเร็จ',
            'back_success' => 'ความสำเร็จของการไถ่ถอน，【เงินต้น+ดอกเบี้ย】รวม【 :money รวม】โอนไปยังบัญชีของคุณแล้ว'
        ],

        'transfer' => [
            'api_not_open' => 'ยังไม่เปิด',
            'change_hand' => 'เปลี่ยนเป็น【ถ่ายโอนไปยังเกมด้วยตนเอง】โหมด',
            'change_auto' => 'เปลี่ยนเป็น【ถ่ายโอนไปยังเกมโดยอัตโนมัติ】โหมด',

            'field' => [
                'fs_money' => 'กระเป๋าแบ็ควอเตอร์',
                'money' => 'กระเป๋าคุมข้อมูลส่วนกลาง'
            ]
        ],

        'team' => [
            'not_direct_child' => 'บัญชีนี้ไม่ใช่บัญชีรองของคุณทันที，ไม่สามารถปฏิบัติการได้',
            'member_name_regex' => 'ชื่อผู้ใช้จะต้องเริ่มต้นด้วยตัวอักษรตัวพิมพ์เล็กและสามารถมีตัวอักษรตัวพิมพ์เล็กและตัวเลขเท่านั้น',
            'not_set_rate' => 'โปรดตั้งค่าส่วนลดสำหรับเกมทุกประเภท',
        ],

        'register' => [
            'captcha_required' => 'กรุณาใส่รหัสยืนยันที่ถูกต้อง',
            'register_fail' => 'การลงทะเบียนล้มเหลว',
            'register_success' => 'การลงทะเบียนสำเร็จ',
            'invite_code_required' => 'กรุณากรอกข้อมูลรหัสเชิญ'
        ],

        'login' => [
            'name_psd_err' => 'บัญชีหรือรหัสผ่านไม่ถูกต้อง',
            'demo_not_open' => 'ระบบไม่ได้เปิดใช้งานฟังก์ชั่นการสาธิต',
        ],

        'activity' => [
            'no_need_apply' => 'กิจกรรมนี้ไม่จำเป็นต้องสมัคร',
            'apply_repeat' => 'คุณได้สมัครกิจกรรมนี้วันนี้，อย่าทำซ้ำแอปพลิเคชัน',
            'apply_success' => 'แอปพลิเคชันสำเร็จ，โปรดรอผลการประมวลผล',
            'apply_fail' => 'แอปพลิเคชันล้มเหลว，โปรดลองใหม่อีกครั้ง',
        ],

        'wheel' => [
            'wheel_desc' => 'เงินฝากขั้นต่ำที่ Sands Entertainment ในวันนั้น :money มากกว่า，และจำนวนเงินเดิมพันทั้งหมดที่มีประสิทธิภาพตรงตามข้อกำหนดการฝากขั้นต่ำสำหรับของขวัญ :times สมาชิกขึ้นไป，จำนวนแผ่นเสียงที่โชคดีจะได้รับ，และมีโอกาสที่จะได้รับ :award ，โควต้าไม่ จำกัด，รีบเข้าร่วม！'
        ],

        'credit_pay' => [
            'not_open' => '【ขอยืม】ยังไม่ได้เปิด',
            'member_not_exist_or_forbidden' => 'สมาชิกไม่มีอยู่หรือถูกปิดการใช้งาน',
            'member_info_error' => 'การป้อนข้อมูลสมาชิกไม่ถูกต้อง',
            'user_credit_remained' => 'ตรวจสอบว่าคุณยังมีเงินกู้ที่ยังไม่ได้ชำระ，โปรดชำระเงินกู้ก่อนที่จะยืม',
            'borrow_max' => 'ยืมได้มากที่สุดเท่านั้น【 :money หยวน】',
            'borrow_success' => 'ส่งใบสมัครแล้ว，ส่งเรียบร้อยแล้ว2กรุณามาหลังจากชั่วโมง“สอบถามวงเงินสินเชื่อ”ไม่ว่าจะเป็นการกู้ยืมเงินที่ประสบความสำเร็จ',
            'lend_total' => 'กรุณาชำระหนี้ทั้งหมดในครั้งเดียว',
            'money_not_enough' => 'โปรดตรวจสอบให้แน่ใจว่ามีเงินเพียงพอในบัญชีกลางเพื่อชำระคืน',
            'lend_success' => 'การชำระคืนสำเร็จ'
        ],

        'game' => [
            'not_login' => 'กรุณาเข้าสู่ระบบก่อน',
            'no_api_code' => 'ต้องการapi_codeอาร์กิวเมนต์',
            'api_member_lang_not_equal' => 'สกุลเงินของอินเทอร์เฟซที่ป้อนไม่สอดคล้องกับสกุลเงินของสมาชิก',
            'demo_game' => 'บัญชีตัวอย่างสามารถเข้าสู่อินเทอร์เฟซสีระบบเท่านั้น',
            'api_code_not_exist' => 'ไม่มีอินเตอร์เฟสอยู่，กรุณาตรวจสอบ',
            'api_code_not_open' => 'อินเทอร์เฟซยังไม่เปิด，โปรดเลือกเกมอื่น',
            'operate_fail' => 'การดำเนินการล้มเหลว，:msg กรุณาติดต่อฝ่ายบริการลูกค้า',
            'member_api_create_err' => 'สร้างสมาชิกในพื้นที่APIบัญชีล้มเหลว',
            'api_money_not_enough' => 'อินเทอร์เฟซไม่เพียงพอ，กรุณาติดต่อฝ่ายบริการลูกค้า',
            'member_money_not_enough' => 'ยอดเงินในบัญชีไม่เพียงพอ，ไม่สามารถถ่ายโอนไปยังส่วนต่อประสาน :money หยวน',
            'api_money_transfer_fail' => 'ล้มเหลวในการหักจำนวนเงินในบัญชี，',
            'api_money_transfer_add_fail' => 'เพิ่มจำนวนอินเตอร์เฟซที่ผิดปกติหลังจากถ่ายโอนไปยังเกม，',
            'api_money_transfer_back_fail' => '【 :title】อินเทอร์เฟซเกมคืนเงินจำนวนบัญชีผิดปกติ，',
            'api_money_transfer_err' => '转入【 :title】อินเทอร์เฟซล้มเหลว，ข้อความผิดพลาด:',
            'api_money_transfer_success' => 'โอน【 :title】อินเทอร์เฟซสำเร็จ',

            'transfer_out_error' => '【 :money】อินเทอร์เฟซไม่เพียงพอ，ล้มเหลวในการถ่ายโอนเกม',
            'transfer_out_api_error' => 'ย้ายออกจากเกม [:title] โควต้าอินเทอร์เฟซล้มเหลว ข้อความแสดงข้อผิดพลาด:',
            'transfer_out_add_error' => 'หลังจากโอนอินเทอร์เฟซ [:title] จำนวนอินเทอร์เฟซจะถูกหักและจำนวนบัญชีผู้ใช้จะเพิ่มขึ้น การทำงานผิดปกติ:',
            'transfer_out_success' => 'โอนออก 【:title】เกมสำเร็จ',
            'api_parameter_err' => 'พารามิเตอร์ของระบบไม่ถูกต้อง',
            'lottery_error' => 'ข้อผิดพลาดที่อยู่สีของระบบ，ไม่ได้เปิดฟังก์ชั่นลอตเตอรีท้องถิ่น，กรุณาติดต่อเจ้าหน้าที่เปิดบัญชี',
            'lottery_api_not_exist' => 'ข้อผิดพลาดที่อยู่สีของระบบ，ไม่ได้เปิดฟังก์ชั่นลอตเตอรีท้องถิ่น，กรุณาติดต่อเจ้าหน้าที่เปิดบัญชี',
        ],

        'agent_fd_rates' => [
            'lower_than_system' => 'ประเภทเกม【 :game_type】จุดต่อต้านน้ำต้องไม่ต่ำกว่าจุดต่ำสุดที่กำหนดโดยระบบ【 :rate】',
            'higher_than_system' => 'ประเภทเกม【 :game_type】จุดต่อต้านน้ำต้องไม่สูงกว่าจุดสูงสุดที่กำหนดโดยระบบ【 :rate】',
            'rate_not_set' => 'ประเภทเกมของคุณ【 :game_type】ยังไม่ได้ตั้งค่าจุดต่อต้านน้ำ，กรุณาติดต่อตัวแทนหรือผู้ดูแลระบบที่เหนือกว่าของคุณ',
            'child_rate_err' => 'ประเภทเกมรอง【 :game_type】จุดต่อต้านน้ำต้องไม่สูงกว่าจุดของตัวเอง【 :rate】',
            'top_rate_err' => 'ประเภทเกม【 :game_type】จุดต่อต้านน้ำต้องไม่ต่ำกว่าจุดสูงสุดของผู้ใต้บังคับบัญชาของเอเจนต์【 :rate】',
            'agent_rate_err' => 'ประเภทเกม【 :game_type】จุดต่อต้านน้ำต้องไม่สูงกว่าจุดของตัวเอง【 :rate】',
        ],

        'invite_rate' => [
            'self_rate_err' => 'เชิญลิงค์ลงทะเบียน【 :game_type】ประเภทของส่วนลดต้องไม่สูงกว่าส่วนลดของคุณเอง',
            'lower_than_system' => 'เชิญลิงค์ลงทะเบียน【 :game_type】ประเภทของจุดส่งคืนต้องไม่ต่ำกว่าจุดต่ำสุดที่กำหนดโดยระบบ【 :rate】'
        ],

        'captcha' => [
            'check_err' => 'ข้อผิดพลาดรหัสยืนยัน',
            'out_of_date' => 'รหัสยืนยันหมดอายุแล้ว，โปรดรีเฟรชและลองใหม่อีกครั้ง',
        ],

        'task' => [
            'no_task' => 'ไม่มีงานที่ต้องทำให้เสร็จ',
            'task_complete_title' => 'การแจ้งเตือนเสร็จสิ้นภารกิจ',
            'task_complete_desc' => 'ขอแสดงความยินดีกับการทำภารกิจให้สำเร็จ【 :title】，รางวัลภารกิจ：',
            'level_up_desc_start' => 'แจกจ่ายสมาชิก【 :name】จาก【:old_level ระดับ】ไปยัง【:level ระดับ】รางวัลโปรโมชั่น，เนื้อหารางวัลรวมถึง：“',
            'level_up_award' => 'โปรโมชั่นรางวัล',
            'level_up_title' => 'ประกาศรางวัลการส่งเสริมการขาย',
            'level_up_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :old_level ระดับ ~ :level ระดับ】โปรโมชั่นรางวัล。',
            'week_award_title' => 'Zhou Yulu ออกประกาศ',
            'week_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】โจวเงินเดือน【 :money หยวน】',
            'month_award_title' => 'ประกาศรายเดือน',
            'month_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】เดือนเงินเดือน【 :money หยวน】'
        ],

        'level_config' => [
            'level_up_award_title' => 'การแจ้งเตือนการส่งเสริมการออกของขวัญ',
            'level_up_award_desc' => 'ขอแสดงความยินดีกับการอัพเกรดเป็น【 :level_name】，อัพเกรดรางวัลเป็น【:money หยวน】，และรางวัลวงเงินเครดิต 【:credit หยวน】',
            'level_up_award_msg' => 'สมาชิก【 :name】รับ【 :level】ระดับโปรโมชั่นของขวัญ【 :money หยวน】，และรางวัลวงเงินเครดิต 【:credit หยวน】',

            'day_bonus_award_title' => 'ประกาศการชำระเงินของขวัญรายวัน',
            'day_bonus_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】ของขวัญรายวัน【 :money หยวน】',
            'day_bonus_award_msg' => 'สมาชิกที่ได้รับ【 :levelระดับ】ของขวัญรายวัน，แจกรางวัล【 :money หยวน】',

            'week_bonus_award_title' => 'ประกาศการชำระเงินของขวัญรายสัปดาห์',
            'week_bonus_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】ของขวัญรายสัปดาห์【 :money หยวน】',
            'week_bonus_award_msg' => 'สมาชิกที่ได้รับ【 :level ระดับ】ของขวัญรายสัปดาห์，แจกรางวัล【 :money หยวน】',

            'month_bonus_award_title' => 'ประกาศการชำระเงินของขวัญรายเดือน',
            'month_bonus_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】ของขวัญรายเดือน【 :money หยวน】',
            'month_bonus_award_msg' => 'สมาชิกที่ได้รับ【 :level ระดับ】ของขวัญรายเดือน，แจกรางวัล【 :money หยวน】',

            'year_bonus_award_title' => 'ประกาศการออกของขวัญประจำปี',
            'year_bonus_award_desc' => 'ขอแสดงความยินดีกับคุณได้รับ【 :level ระดับ】ของขวัญประจำปี【 :money หยวน】',
            'year_bonus_award_msg' => 'สมาชิกที่ได้รับ【 :level ระดับ】ของขวัญประจำปี，แจกรางวัล【 :money หยวน】',
        ]
    ],

    'configs' => [
        "is_redbag_open" => "จะเปิดซองจดหมายสีแดง",
        "redbag_min_money" => "จำนวนเงินขั้นต่ำของซองจดหมายสีแดง",
        "redbag_max_money" => "จำนวนเงินสูงสุดของซองจดหมายสีแดง",
        "redbag_day_times" => "จำนวนซองจดหมายสีแดงต่อวัน",
        "is_daily_bonus_open" => "จะเปิดการลงชื่อเข้าใช้หรือไม่",
        "is_daily_bonus_auto" => "ลงชื่อเข้าใช้จะได้รับรางวัลโดยอัตโนมัติ",
        "activity_money_type" => "ประเภทกระเป๋าเงินรางวัลกิจกรรม",
        "member_fs_money_type" => "สมาชิกออกกระเป๋าเงินต่อต้านน้ำ",
        "is_realtime_fs_mode" => "ไม่ว่าจะเปิดโหมดต่อต้านน้ำเป็นครั้งคราว",
        "activity_yuebao_plan_enable" => "จะเปิดยอดซื้อโซลูชั่น",
        "activity_yuebao_enable" => "จะเปิดยอดสมบัติ",
        "activity_wheel_is_open" => "ว่าจะเปิดกิจกรรมล้อใหญ่โชคดี",
        "is_system_maintenance" => "จะเปิดการบำรุงรักษาระบบหรือไม่",
        "system_maintenance_whitelist" => "การบำรุงรักษาระบบ IP รายการที่อนุญาต",
        "site_domain" => "ชื่อโดเมนสถานีที่ใช้งานอยู่",
        "wap_qrcode" => "แอพมือถือดาวน์โหลดรหัส QR",
        "wap_app_link" => "ที่อยู่ดาวน์โหลดแอพมือถือ",
        "service_link" => "การเชื่อมโยงการบริการลูกค้า",
        "kefu_wechat_qrcode" => "จดหมายไมโครบริการลูกค้ารหัส QR",
        "site_logo" => "เว็บไซต์Logo",
        "site_logo2" => "เว็บไซต์สำรองLOGO",
        "kefu_qq" => "บริการลูกค้าQQ",
        "site_email" => "กล่องจดหมายของเว็บไซต์",
        "site_slogan" => "เว็บไซต์รองlogo",
        "site_pc" => "ที่อยู่ด้านคอมพิวเตอร์",
        "site_mobile" => "URL มือถือ",
        "is_scroll_adv_open" => "จะเปิดโฆษณาเลื่อนหรือไม่",
        "is_demo_play_open" => "จะเปิดใช้งานฟังก์ชั่นการสาธิตหรือไม่",
        "is_open_register" => "จะเปิดหน้าลงทะเบียนหรือไม่",
        "activity_jiebei_enable" => "จะเปิดยืม",
        "transfer_start" => "ถอนเวลาเริ่มต้น",
        "transfer_end" => "กำหนดเวลาถอนเงิน",
        "min_transfer" => "จำนวนเงินถอนขั้นต่ำ",
        "max_transfer" => "จำนวนเงินถอนสูงสุด",
        "ml_percent" => "ร้อยละของจำนวนรหัส",
        "ml_drawing_percent" => "ร้อยละของค่าธรรมเนียมการถอนเมื่อจำนวนรหัสเหลืออยู่",
        "daili_active_money" => "มาตรฐานการเติมเงินสมาชิกที่ใช้งานอยู่",
        "agent_fd_mode" => "เปิดใช้งานโหมดพร็อกซีไม่ จำกัด หรือไม่",
        "is_auto_agent" => "การลงทะเบียนสมาชิกเริ่มต้นคือพร็อกซี",
        "notice_type" => "โหมดเตือนความจำ",
        "yuebao_audio" => "เสียงเตือนการซื้อยอดคงเหลือ",
        "activity_audio" => "การแจ้งเตือนเสียงแอปพลิเคชันกิจกรรม",
        "message_audio" => "จดหมายเตือนความจำเสียงภายในสถานี",
        "member_audio" => "เสียงเตือนการเข้าสู่ระบบของผู้เล่น",
        "drawing_audio" => "ถอนเสียงเตือน",
        "rechargel_audio" => "การแจ้งเตือนเสียงเติมเงิน",
        "agent_apply_audio" => "แอปพลิเคชันตัวแทนยังไม่ได้ดำเนินการ",
        "credit_apply_audio" => "แอปพลิเคชันการยืมยังไม่ได้ดำเนินการ",
        "credit_overdue_audio" => "การแจ้งเตือนล่าช้ายืม",
        "system_maintenance_message" => "เคล็ดลับการบำรุงรักษาเว็บไซต์",
        "bank_desc" => "รายละเอียดบริษัท",
        "site_title" => "ชื่อเว็บไซต์",
        "site_keyword" => "คำหลักของเว็บไซต์",
        "site_name" => "ชื่อเว็บไซต์",
        "online_pay_title" => "ชื่อการชำระเงินออนไลน์",
        "online_pay_desc" => "แนะนำการชำระเงินออนไลน์",
        "company_pay_title" => "ชื่อ บริษัท",
        "company_pay_desc" => "แนะนำ บริษัท",
        "register_remark" => "คำอธิบายการลงทะเบียน",
        "register_agreement" => "ข้อตกลงการลงทะเบียน",
        "nav_jiechi" => "การสอนการไฮแจ็ก",
        "guideline_desc" => "คำอธิบายบรรทัดอย่างง่าย",
        "hotgame_desc" => "คำอธิบายเกมยอดนิยม",
        "wheel_rule" => "ข้อกำหนดและกฎของกิจกรรม Lucky Big Rotary",
        "credit_detail" => "รายละเอียดกิจกรรมยืม",
        "credit_rule" => "กฎเครดิตยืม",
        "credit_xize" => "รายละเอียดกิจกรรมการยืม",
        "credit_borrow" => "คำอธิบายการยืม",
        "credit_lend" => "คำแนะนำการชำระคืนเงินกู้",
        "levelup_slot_activity" => "รายละเอียดกิจกรรมอัพเกรดอิเล็กทรอนิกส์",
        "levelup_slot_example" => "ตัวอย่างกิจกรรมอัพเกรดอิเล็กทรอนิกส์",
        "levelup_slot_level" => "คำแนะนำการอัพเกรดอิเล็กทรอนิกส์",
        "levelup_slot_month" => "คำอธิบายเดือนอัพเกรดอิเล็กทรอนิกส์",
        "levelup_live_activity" => "รายละเอียดกิจกรรมอัพเกรดในชีวิตจริง",
        "levelup_live_example" => "ตัวอย่างกิจกรรมอัพเกรดในชีวิตจริง",
        "levelup_live_level" => "คำแนะนำการอัพเกรดการอัพเ",
        "levelup_live_month" => "คำอธิบายเดือนอัพเกรดคนจริง",
        "app_tuiguang" => "บทช่วยสอนการส่งเสริมการขาย",
        "app_xima" => "การสอนการล้างรหัส",
        "app_fanyong" => "อัตราส่วนผลตอบแทน",
        "app_xima_text" => "คำอธิบายการล้างรหัส",
        "activity_shengji_enable" => "จะเปิดกิจกรรมอัปเกรดหรือไม่",
        "vip1_is_register_sms_open" => "จะเปิดการตรวจสอบการลงทะเบียน SMS",
        "service_link" => "การเชื่อมโยงการบริการลูกค้า",
        "service_line" => "Line",
        "service_line_pic" => "Lineรหัสสองมิติ",
        "service_phone" => "โทรศัพท์",
        "service_phone2" => "โทรศัพท์ 2",
        "is_backend_google_auth" => "การเข้าสู่ระบบพื้นหลังจะเปิดรหัสยืนยันของ Google หรือไม่",
        "service_skype" => "Skype",
        "service_telegram" => "Telegram",
        "service_logo_link" => "LOGOกระโดดไปยังลิงค์",
        "vip1_is_login_captcha_open" => "จะเปิดรหัสยืนยันการเข้าสู่ระบบของสมาชิก",

        "vip1_lang_default" => "ภาษาเริ่มต้นส่วนหน้า",
        "vip1_lang_fields" => "ภาษาเปิดด้านหน้า"
    ],

    'agent_page' => [
        'login' => [
            'username' => 'ชื่อผู้ใช้',
            'password' => 'รหัสผ่าน',
            'captcha' => 'รหัสยืนยัน',
            'refresh' => 'คลิกรีเฟรช',
            'login' => 'เข้าสู่ระบบทันที',
        ],

        'basic' => [
            'main_title' => 'พื้นหลังการจัดการตัวแทน',
        ],

        'title' => [
            'main' => 'หน้าแรกพื้นหลัง',
            'offline' => 'สมาชิกออฟไลน์',
            'offline_list' => 'รายการดาวน์ไลน์',
            'promote_site' => 'เว็บไซต์ส่งเสริมการขาย',
            'agent_report' => 'รายงานตัวแทน',
            'recharge_list' => 'บันทึกการฝากสมาชิก',
            'drawing_list' => 'บันทึกการถอนสมาชิก',
            'money_log' => 'บันทึกการเปลี่ยนแปลงยอดคงเหลือออฟไลน์',
            'fd_logs' => 'บันทึกส่วนลดออฟไลน์',
            'game_records' => 'รายงานการชนะหรือแพ้ของสมาชิก'
        ],

        'notice' => [
            'traditional_only' => 'โหมดพร็อกซี่แบบดั้งเดิมเท่านั้นที่สามารถเข้าถึงหน้า',
            'allagent_only' => 'หน้านี้สามารถเข้าถึงได้เฉพาะกับตัวแทนแห่งชาติ',
            'rate_not_exist' => 'ข้อมูลสมาชิกกลับไม่มี',
            'direct_rate_modify' => 'คุณสามารถปรับเปลี่ยนตำแหน่งของผู้ใต้บังคับบัญชาโดยตรง'
        ],

        'desc' => [
            'offline_num' => 'จำนวนสมาชิก',
            'agent_default_rate' => 'ดาวน์ไลน์พร็อกซี่เริ่มต้น',
        ],

        'field' => [
            'is_agent' => 'ไม่ว่าจะเป็นตัวแทนหรือไม่',
            'register_at' => 'เวลาลงทะเบียน',
            'own_rate' => 'จุดสะท้อนตนเอง',
            'unset' => 'ไม่ได้ตั้งค่า',
            'offline_default_rate' => 'บิตเริ่มต้นของบรรทัดล่าง',
            'pc_agent_url' => 'เว็บไซต์โปรโมชั่นพีซี',
            'wap_agent_url' => 'เว็บไซต์ WAP โปรโมชั่น',
            'qrcode_title' => 'ขยายรหัส 2D',
            'time_range' => 'เวลาเริ่มต้นและสิ้นสุด',

            'total_deposit' => 'เงินฝากรวม',
            'recharge_count' => 'ปากกาเงินฝาก',
            'total_drawing' => 'ถอน',
            'drawing_count' => 'จำนวนปากกา',
            'dividend_hongli' => 'เงินปันผล',
            'dividend_activity' => 'เสนอกิจกรรม',
            'dividend_fs' => 'ต่อต้านน้ำ',
            'dividend_other' => 'อย่างอื่น',
            'total_profit' => 'กำไรรวม',
            'member_win_and_loss' => 'สมาชิกชนะหรือแพ้',

            'add_sub' => 'เพิ่มขึ้น/ทำให้ลดลง',
            'fs_center' => 'ต่อต้านน้ำ/กระเป๋าสตางค์ส่วนกลาง',

            'api_name' => 'APIเชื่อมต่อ'
        ],

        'btn' => [
            'set_offline_default' => 'ตั้งค่าระดับล่างเริ่มต้นกลับ',
            'qrcode' => 'รหัสสองมิติ'
        ]
    ]
];
